{"title":"News Index","url":"https:\/\/north.mandelfoundation.org.il\/english\/About\/News\/Pages\/NewsIndex.aspx","stats":{"total":58,"inner":46,"images":25,"attachments":0,"outer_links":4},"outer":{"fellows-day-2023-s":{"title":"Mandel Fellows Day 2023","url":"https:\/\/north.mandelfoundation.org.il\/_layouts\/Mandel13\/Internet\/RedirectTo.aspx?ID=MFI\/english\/About\/News\/Pages\/Fellows-Day-2023.aspx"},"atzmaut_2023newsen_s":{"title":"Israel at 75: The Declaration of Independence","url":"https:\/\/north.mandelfoundation.org.il\/_layouts\/Mandel13\/Internet\/RedirectTo.aspx?ID=MFI\/english\/About\/News\/Pages\/Mandel-Declaration-of-Independence-Initiative.aspx"},"grad-news2022s":{"title":"2022 Mandel Graduation Ceremony Held in Jerusalem","url":"https:\/\/www.mandelfoundation.org.il\/english\/About\/News\/Pages\/Mandel-Graduation-2022.aspx"},"mfi-graduation-2021s":{"title":"2021 Mandel Graduation Ceremony Held in Jerusalem","url":"https:\/\/www.mandelfoundation.org.il\/english\/About\/News\/Pages\/Graduation-2021.aspx"},"north-opening-2020---0":{"title":"Mandel Program for Social Leadership in the North","url":"https:\/\/north.mandelfoundation.org.il\/english\/Programs\/Pages\/Mandel-Program-for-Social-Leadership-in-the-North.aspx"},"north-opening-2020---1":{"title":"Mandel Program for Public Service Leadership","url":"https:\/\/north.mandelfoundation.org.il\/english\/Programs\/Pages\/Mandel-Program-for-Leadership-in-the-Public-Service.aspx"},"north-opening-2020---2":{"title":"Mandel Program for Regional Leadership in the North","url":"https:\/\/north.mandelfoundation.org.il\/english\/Programs\/Pages\/Mandel-Program-for-Regional-Leadership-in-the-North.aspx"},"mandel-memorial-service-en_s":{"title":"Memorial Service for Morton L. Mandel","url":"https:\/\/youtu.be\/vXEACNbcEz0"},"morton-l-mandel-1921-2019es":{"title":"Morton L. Mandel, 1921-2019","url":"https:\/\/www.mandelfoundation.org.il\/english\/About\/News\/Pages\/The-Mandel-Foundation-Mourns-the-Loss-of-Morton-L-Mandel.aspx"},"2019-graduation_s":{"title":"2019 Mandel Graduation Ceremony Held in Jerusalem","url":"https:\/\/north.mandelfoundation.org.il\/_layouts\/Mandel13\/Internet\/RedirectTo.aspx?ID=MFI\/english\/About\/News\/Pages\/2019-Mandel-Graduation.aspx"},"mcn_register_2017s":{"title":"Registration Opens for Cohort 2 of Regional Leadership Program","url":"https:\/\/north.mandelfoundation.org.il\/english\/Programs\/Pages\/Mandel-Program-for-Regional-Leadership-in-the-North.aspx"},"graduation-regional1---0":{"title":"View the animated videos of the individual projects (Hebrew) >>","url":"https:\/\/north.mandelfoundation.org.il\/Fellows\/Projects\/RegionalLeadership1\/index.aspx"},"north-social_s":{"title":"Mandel Social Leadership Program to Open in the Fall","url":"https:\/\/north.mandelfoundation.org.il\/english\/Programs\/Pages\/Mandel-Program-for-Social-Leadership-in-the-North.aspx"},"religious-secular-meetings-in-migdal-haemek_s":{"title":"Mandel Graduates Bridge Religious-Secular Divide","url":"http:\/\/www.migdal-haemeq.muni.il\/Lists\/List1\/DispForm.aspx?ID=2265"}},"errors":[],"list":{"cinemandel-2023":{"title":"CineMandel: A Social Cinema Club for Graduates","date":"2023-08-01","image":"https:\/\/north.mandelfoundation.org.il\/english\/SiteCollectionImages\/News\/cinimandel-1s.jpg","excerpt":"A series of cultural and social events that enable Mandel graduates in the North to reconnect to the Mandel spirit in an experiential way ","link":"https:\/\/north.mandelfoundation.org.il\/english\/About\/News\/Pages\/CineMandel-2023.aspx","is_inner":"yes","slug":"cinemandel-2023","text":"CineMandel, a social cinema club for all Mandel graduates who live in northern Israel, is a joint initiative of Liraz Maanit and Katef Morad Salama of the Mandel Center for Leadership in the North. The goal of the initiative is to host cultural and social events organized around movies, creating a space in which graduates can reconnect to the spirit of Mandel in an experiential way.\nCineMandel was launched at the beginning of the 2022-2023 academic year as a pilot comprising five events. The movies shown were chosen very carefully. They were all connected to the field of humanities and reflected the Mandel Foundation’s values of leadership and tolerance. In addition, they all had a connection to the north of Israel, and reflected the broad tapestry of the region’s identities.\nCinema was chosen as the focus of the series because it is a narrative medium that tells a story visually. Film allows us to view others, who may be similar to us or different from us. It also brings us face-to-face with ourselves and with our emotions, whether expressed or repressed. Movies also provide us with opportunities for safe encounters with figures and identities that we do not meet every day, without making us feel exposed or putting us on the defensive, and thus put us in an optimal position to listen to others and explore their personal stories.\nThe series was spearheaded by visiting faculty member Katef Morad Salama, one of the leaders of pedagogical development at the Mandel Center for Leadership in the North and the academic consultant to its program for regional leadership, who has a background in film, and Liraz Maanit, the Center’s graduate community facilitator. They realized the potential of events built around screening movies with strong, social messages combined with discussions that reflect the diversity of Mandel graduates. These events offer an exceptional opportunity to create a safe space for graduates to voice their feelings and opinions, while bonding socially. They also bring together graduates of the Foundation’s different programs who live and work in the North.\nThe project began at the end of January with a screening of the movie Cinema Sabaya, Israel’s Oscar submission for 2023, which focuses on a group of Jewish and Arab women who meet at a videography workshop held in the Netanya–Wadi ’Ara area and document their lives. The screening was followed by a conversation with the director, Orit Fouks Rotem.\nIn February, the drama More Than I Deserve was shown, in the presence of the movie’s director, Pini Tavger, who wrote the screenplay based on his life in Kiryat Ata as the son of a single mother. The film explores immigration from Ukraine, addressing a burning issue in Israeli society.\nThe third event was a special evening held in March, which included an iftar meal to break the Ramadan fast. Dr. Ohad Ofaz spoke about a unique program at Oranim College of Education called “Dialogue Through Cinema,” in which Jewish and Arab students, both religious and secular, participate in intercultural dialogue and create short films together. The discussion was followed by a screening of Do You Hear the Moazin? and with a conversation with the movie's creators, Awni Matani and Alex Roitman.\nThe fourth event, held in mid-May, was different from the others and was a family event, in which the graduates were invited to bring their children. Instead of a single movie, two episodes of the successful children’s series Madrasa, produced by the Israel Broadcasting Corporation, were shown. The discussion afterward featured actors from the series.\nThe fifth and final event took place in mid-June and featured the documentary movie My Hero Brother, which follows a group of young Israelis with Down syndrome who embarked on a backpacking trek in the Himalayas, accompanied by their brothers and sisters. After the screening, there was a conversation with the director and writer, Yonatan Nir.\nAll the events were attended by dozens of graduates from different Mandel programs conducted by the Foundation’s five program units, with an average of 80 graduates attending each. The events all garnered many responses that cited the importance of the event for graduates and revealed how keen the graduates are for an ongoing, meaningful relationship with the Foundation. “It was uplifting, and as usual, thought-provoking, creating a positive form of writer’s envy,” wrote one participant. “The most pleasing thing for me was that for more than two hours, we were able to come together, speak, listen, and share social, communal, and personal issues just like we used to. It was an absolute pleasure.”\n","html_content":"<p><img src=\"\/english\/SiteCollectionImages\/News\/cinimandel-1.jpg\" alt=\"Five panelists sitting on the stage\" class=\"img-responsive\">\n   <span class=\"ms-rteStyle-References\">Photo: Liraz Maanit<\/span><\/p>\n<p>CineMandel, a social cinema club for all Mandel graduates who live in northern Israel, is a joint initiative of<strong> Liraz Maanit<\/strong> and <strong>Katef Morad Salama<\/strong> of the Mandel Center for Leadership in the North. The goal of the initiative is to host cultural and social events organized around movies, creating a space in which graduates can reconnect to the spirit of Mandel in an experiential way.<\/p>\n<p>CineMandel was launched at the beginning of the 2022-2023 academic year as a pilot comprising five events. The movies shown were chosen very carefully. They were all connected to the field of humanities and reflected the Mandel Foundation’s values of leadership and tolerance. In addition, they all had a connection to the north of Israel, and reflected the broad tapestry of the region’s identities.<\/p>\n<p>Cinema was chosen as the focus of the series because it is a narrative medium that tells a story visually. Film allows us to view others, who may be similar to us or different from us. It also brings us face-to-face with ourselves and with our emotions, whether expressed or repressed. Movies also provide us with opportunities for safe encounters with figures and identities that we do not meet every day, without making us feel exposed or putting us on the defensive, and thus put us in an optimal position to listen to others and explore their personal stories.<\/p>\n<p>\n   <img src=\"\/english\/SiteCollectionImages\/News\/cinimandel-2.jpg\" alt=\"Two women in conversation on the stage\" class=\"img-responsive\">\n   <span class=\"ms-rteStyle-References\">Photo: Liraz Maanit<\/span><\/p>\n<p>The series was spearheaded by visiting faculty member Katef Morad Salama, one of the leaders of pedagogical development at the Mandel Center for Leadership in the North and the academic consultant to its program for regional leadership, who has a background in film, and Liraz Maanit, the Center’s graduate community facilitator. They realized the potential of events built around screening movies with strong, social messages combined with discussions that reflect the diversity of Mandel graduates. These events offer an exceptional opportunity to create a safe space for graduates to voice their feelings and opinions, while bonding socially. They also bring together graduates of the Foundation’s different programs who live and work in the North.<\/p>\n<p>The project began at the end of January with a screening of the movie Cinema Sabaya, Israel’s Oscar submission for 2023, which focuses on a group of Jewish and Arab women who meet at a videography workshop held in the Netanya–Wadi ’Ara area and document their lives. The screening was followed by a conversation with the director, <strong>Orit Fouks Rotem<\/strong>.<\/p>\n<p>In February, the drama \n   <em>More Than I Deserve<\/em> was shown, in the presence of the movie’s director, <strong>Pini Tavger<\/strong>, who wrote the screenplay based on his life in Kiryat Ata as the son of a single mother. The film explores immigration from Ukraine, addressing a burning issue in Israeli society.<\/p>\n<p>The third event was a special evening held in March, which included an iftar meal to break the Ramadan fast. \n   <strong>Dr. Ohad Ofaz<\/strong> spoke about a unique program at Oranim College of Education called “Dialogue Through Cinema,” in which Jewish and Arab students, both religious and secular, participate in intercultural dialogue and create short films together. The discussion was followed by a screening of \n   <em>Do You Hear the Moazin?<\/em> and with a conversation with the movie's&nbsp;creators, \n   <strong>Awni Matani<\/strong> and \n   <strong>Alex Roitman<\/strong>.<\/p>\n<p>\n   <img src=\"\/english\/SiteCollectionImages\/News\/cinimandel-3.jpg\" alt=\"The audience sitting around tables at a CineMandel evening\" class=\"img-responsive\">\n   <span class=\"ms-rteStyle-References\">Photo: Liraz Maanit<\/span><\/p>\n<p>The fourth event, held in mid-May, was different from the others and was a family event, in which the graduates were invited to bring their children. Instead of a single movie, two episodes of the successful children’s series <em>Madrasa<\/em>, produced by the Israel Broadcasting Corporation, were shown. The discussion afterward featured actors from the series.<\/p>\n<p>The fifth and final event took place in mid-June and featured the documentary movie <em>My Hero Brother<\/em>, which follows a group of young Israelis with Down syndrome who embarked on a backpacking trek in the Himalayas, accompanied by their brothers and sisters. After the screening, there was a conversation with the director and writer, <strong>Yonatan Nir<\/strong>.<\/p>\n<p>All the events were attended by dozens of graduates from different Mandel programs conducted by the Foundation’s five program units, with an average of 80 graduates attending each. The events all garnered many responses that cited the importance of the event for graduates and revealed how keen the graduates are for an ongoing, meaningful relationship with the Foundation. “It was uplifting, and as usual, thought-provoking, creating a positive form of writer’s envy,” wrote one participant. “The most pleasing thing for me was that for more than two hours, we were able to come together, speak, listen, and share social, communal, and personal issues just like we used to. It was an absolute pleasure.”<br><\/p>\n","images":{"cinimandel-1.jpg":{"src":"https:\/\/north.mandelfoundation.org.il\/english\/SiteCollectionImages\/News\/cinimandel-1.jpg","caption":"Photo: Liraz Maanit"},"cinimandel-2.jpg":{"src":"https:\/\/north.mandelfoundation.org.il\/english\/SiteCollectionImages\/News\/cinimandel-2.jpg","caption":"Photo: Liraz Maanit"},"cinimandel-3.jpg":{"src":"https:\/\/north.mandelfoundation.org.il\/english\/SiteCollectionImages\/News\/cinimandel-3.jpg","caption":"Photo: Liraz Maanit"}},"attachments":[],"outer_links":[]},"fellows-day-2023-s":{"title":"Mandel Fellows Day 2023","date":"2023-05-03","image":"https:\/\/north.mandelfoundation.org.il\/english\/SiteCollectionImages\/News\/Fellows-Day-2023-s.jpg","excerpt":"The annual Fellows Day, held at the Foundation's headquarters in Jerusalem, facilitates interactions among fellows of all the Foundation’s leadership programs in Israel ","link":"https:\/\/north.mandelfoundation.org.il\/_layouts\/Mandel13\/Internet\/RedirectTo.aspx?ID=MFI\/english\/About\/News\/Pages\/Fellows-Day-2023.aspx","is_inner":"no","slug":"fellows-day-2023-s"},"atzmaut_2023newsen_s":{"title":"Israel at 75: The Declaration of Independence","date":"2023-04-26","image":"https:\/\/north.mandelfoundation.org.il\/english\/SiteCollectionImages\/News\/Atzmaut_2023newsEN_s.jpg","excerpt":"Celebrate the 75th anniversary of the founding of the State of Israel by printing a replica of Israel’s Declaration of Independence ","link":"https:\/\/north.mandelfoundation.org.il\/_layouts\/Mandel13\/Internet\/RedirectTo.aspx?ID=MFI\/english\/About\/News\/Pages\/Mandel-Declaration-of-Independence-Initiative.aspx","is_inner":"no","slug":"atzmaut_2023newsen_s"},"northern-connection-2023":{"title":"Northern Connection: Fostering Identity and Responsibility","date":"2023-01-09","image":"https:\/\/north.mandelfoundation.org.il\/english\/SiteCollectionImages\/News\/North-Connection-5s.jpg","excerpt":"A learning module promoting shared regional identity and responsibility among fellows of the Mandel Center for Leadership in the North ","link":"https:\/\/north.mandelfoundation.org.il\/english\/About\/News\/Pages\/Northern-Connection-2023.aspx","is_inner":"yes","slug":"northern-connection-2023","text":"For the past two years, fellows of the Mandel Program for Regional Leadership in the North and the Mandel Program for Leadership for Public Service in the North have been participating in “The Northern Connection,” a study module designed to foster their regional identity and sense of belonging to Israel’s North. This learning module is led by the fellows themselves. They engage in active and independent study and manage the research process from beginning to end, thus finding and developing their own connections to the North through theoretical and practical research on concrete challenges and burning issues that face the region.\nOriginally, the Northern Connection module was taught separately, as part of the curriculum of each of two programs: the Mandel Program for Regional Leadership in the North and the Mandel Program for Leadership for Public Service in the North. This year, however, it was decided that the module be conducted in tandem for the fellows of the two programs. This decision was based on the understanding that while the fellows work in different fields, they operate in intersecting spheres of action and influence. Conducting the module jointly can thus enable fellows to gain a deeper and more comprehensive understanding of their respective areas of activity, strengthen their networking skills and ability to collaborate, and increase opportunities for collaboration between them in order to achieve a significant impact on the ground.\nThe Northern Connection module consists of four subjects that serve as the focus of studies: 1) general and higher education, 2) economic development and the labor market, 3) medicine and health, and 4) local government. The fellows of the two programs work in four small teams, each of which is tasked with investigating one of the above subjects and analyzing their findings with respect to at least three of the following five concerns: 1) the unique characteristics of the North, 2) the diverse society of the North, 3) the nature of local and regional leadership in the North, 4) an exploration of the given subject over time in the North, and 5) relevant public policy.\nMuch thought was devoted to the division of the fellows into teams, with care taken to ensure that each fellow’s area of research would not be in his or her field of employment. This was done to guarantee that fellows would gain different perspectives, be able to develop insights, and might be able to propose creative “outside the box” solutions. As part of their joint study, the fellows were also offered elective classes that could provide them with relevant support.\nThe fellows were first introduced to the module during the opening retreat of their respective programs. Later, in late November, a preparatory meeting was held for the fellows to get to know one another and receive preliminary background material for their area of study. During the next meeting, the teams defined the exact topic that they would investigate, laid out a work plan, and held online meetings with relevant people. Later in the year, the fellows will spend a day in the field, which will include interviews and meetings that will acquaint them with challenges and obstacles related to their chosen topic, while enriching their grasp of the topic and enabling them to outline relevant avenues for change and to propose practical steps for improvement.\nAt the end of the process, the teams of fellows from the two programs will present their work – including the guiding rationale, insights gained, and the action plan or policy tools they devised for addressing the various challenges they confronted – at a dedicated day-long event. Among other things, this event will afford the fellows the opportunity to receive feedback from their peers, the program faculty, and outside professionals and experts who will be invited to the event.\nIn the Mandel Program for Social Leadership in the North, “learning by doing” is the central axis along which we seek to bolster the fellows’ potential for influence. The “learning by doing” approach aims to refine and intensify the fellows’ sense of responsibility and mission, and empowers them to lead and work for the benefit of society in the North and beyond. The combination of knowledge acquisition and practical experience helps the fellows put their learning into practice, incorporate it into their workaday lives, expand their sphere of influence, become more familiar with the diverse society in the North, and deepen their ability to take action for the benefit of society. The fulcrum of this learning axis is in-depth study of the North and its challenges.\nThe field exercise is spread evenly over the year. Often, it is conducted in small “task teams” that intentionally comprise fellows who are diverse professionally, ethnically, and culturally. The teams study designated issues in the North from various perspectives, with the aim of coming up with adequate ways to respond to the challenges and capitalize on the opportunities at hand.\nFollowing participation in a series of preliminary tours titled “A Journey of Exploration of the North,” the fellows set out to work in teams targeting four areas of central relevance to the life and wellbeing of the diverse members of society of the North: 1) public health, 2) general and higher education, 3) urban planning and housing, and 4) economic development and the labor market.\nIn the first week of December, the fellows completed their first segment of study, “Barefoot Learning.” This segment focused on mapping and investigating their designated field by gathering knowledge, raising questions, and analyzing relevant data. Subsequently, a “peak day” was held, during which the fellows presented the results of their work and received feedback from a panel of experts in the various areas of study.\nDuring the last week of January, the fellows will begin the second segment of the field exercise, titled \"Local Stories.\" During this segment, the fellows will characterize and define their chosen topic as it pertains to a specific community or circumscribed location in the North. They will present their findings in mid-February.\nThe group field exercise will be followed by an individual exercise, in which the fellows are urged to focus on a social issue that is of profound interest to them and which they would like to study in depth. The fellows devise their own course of study, including conceptualization, theoretical issues, and relevant academic literature, clarification of positions, analysis of case studies, meetings with key figures, and surveys of relevant organizations. At the end of this process, the fellows will present their research, the areas that they have identified as targets for viable intervention and impact, and their plans for promoting the latter following their graduation from the program.\nThe axis of “learning by doing” includes support from mentors who are experts in the fields and areas of study selected by the fellows, as well as input from a team of experts who provide specific feedback and advice as needed.\n","html_content":"<p>\n   <img src=\"\/english\/SiteCollectionImages\/News\/North-Connection-5.jpg\" class=\"img-responsive\" alt=\"Fellows sitting around a table and working on computers\">\n   <span class=\"ms-rteStyle-References\">A meeting of the employment and economic development group (Photo: Dana Kleinman)<\/span><\/p>\n<p><br>For the past two years, fellows of the Mandel Program for Regional Leadership in the North and the Mandel Program for Leadership for Public Service in the North have been participating in “<strong>The Northern Connection<\/strong>,” a study module designed to foster their regional identity and sense of belonging to Israel’s North. This learning module is led by the fellows themselves. They engage in active and independent study and manage the research process from beginning to end, thus finding and developing their own connections to the North through theoretical and practical research on concrete challenges and burning issues that face the region.<\/p>\n<p>Originally, the Northern Connection module was taught separately, as part of the curriculum of each of two programs: the Mandel Program for Regional Leadership in the North and the Mandel Program for Leadership for Public Service in the North. This year, however, it was decided that the module be conducted in tandem for the fellows of the two programs. This decision was based on the understanding that while the fellows work in different fields, they operate in intersecting spheres of action and influence. Conducting the module jointly can thus enable fellows to gain a deeper and more comprehensive understanding of their respective areas of activity, strengthen their networking skills and ability to collaborate, and increase opportunities for collaboration between them in order to achieve a&nbsp;significant impact on the ground.<\/p>\n<p>The Northern Connection module consists of four subjects that serve as the focus of studies: 1) general and higher education, 2) economic development and the labor market, 3) medicine and health, and 4) local government. The fellows of the two programs work in four small teams, each of which is tasked with investigating one of the above subjects and analyzing their findings with respect to at least three of the following five concerns: 1) the unique characteristics of the North, 2) the diverse society of the North, 3) the nature of local and regional leadership in the North, 4) an exploration of the given subject over time in the North, and 5) relevant public policy.<\/p>\n<p>Much thought was devoted to the division of the fellows into teams, with care taken to ensure that each fellow’s area of research would not be in his or her field of employment. This was done to guarantee that fellows would gain different perspectives, be able to develop insights, and might be able to propose creative “outside the box” solutions. As part of their joint study, the fellows were also offered elective classes that could provide them with relevant support.<\/p>\n<p>The fellows were first introduced to the module during the opening retreat of their respective programs. Later, in late November, a preparatory meeting was held for the fellows to get to know one another and receive preliminary background material for their area of study. During the next meeting, the teams defined the exact topic that they would investigate, laid out a work plan, and held online meetings with relevant people. Later in the year, the fellows will spend a day in the field, which will include interviews and meetings that will acquaint them with challenges and obstacles related to their chosen topic, while enriching their grasp of the topic and enabling them to outline relevant avenues for change and to propose practical steps for improvement.<\/p>\n<p>At the end of the process, the teams of fellows from the two programs will present their work – including the guiding rationale, insights gained, and the action plan or policy tools they devised for addressing the various challenges they confronted – at a dedicated day-long event. Among other things, this event will afford the fellows the opportunity to receive feedback from their peers, the program faculty, and outside professionals and experts who will be invited to the event.<br><br><\/p>\n<p><img src=\"\/english\/SiteCollectionImages\/News\/North-Connection-4.jpg\" class=\"img-responsive\" alt=\"Members of a study group having a discussion in a classroom\">\n<span class=\"ms-rteStyle-References\">&nbsp;A meeting of the health group (Photo: Rinat Pilipp)<\/span><\/p>\n<p>In the Mandel Program for Social Leadership in the North, “learning by doing” is the central axis along which we seek to bolster the fellows’ potential for influence. The “learning by doing” approach aims to refine and intensify the fellows’ sense of responsibility and mission, and empowers them to lead and work for the benefit of society in the North and beyond. The combination of knowledge acquisition and practical experience helps the fellows put their learning into practice, incorporate it into their workaday lives, expand their sphere of influence, become more familiar with the diverse society in the North, and deepen their ability to take action for the benefit of society. The fulcrum of this learning axis is in-depth study of the North and its challenges.<\/p>\n<p>\n   <strong>The field exercise<\/strong> is spread evenly over the year. Often, it is conducted in small “task teams” that intentionally comprise fellows who are diverse professionally, ethnically, and culturally. The teams study designated issues in the North from various perspectives, with the aim of coming up with adequate ways to respond to the challenges and capitalize on the opportunities at hand.<\/p>\n<p>Following participation in a series of preliminary tours titled “A Journey of Exploration of the North,” the fellows set out to work in teams targeting four areas of central relevance to the life and wellbeing of the diverse members of society of the North: 1) public health, 2) general and higher education, 3) urban planning and housing, and 4) economic development and the labor market.<br><br><\/p>\n<p>\n   <br>In the first week of December, the fellows completed their first segment of study, “<strong>Barefoot Learning<\/strong>.” This segment focused on mapping and investigating their designated field by gathering knowledge, raising questions, and analyzing relevant data. Subsequently, a “peak day” was held, during which the fellows presented the results of their work and received feedback from a panel of experts in the various areas of study.<\/p>\n<p>During the last week of January, the fellows will begin the second segment of the field exercise, titled \"<strong>Local Stories<\/strong>.\" During this segment, the fellows will characterize and define their chosen topic as it pertains to a specific community or circumscribed location in the North. They will present their findings in mid-February.<\/p>\n<p>The group field exercise will be followed by an \n   <strong>individual exercise,<\/strong> in which the fellows are urged to focus on a social issue that is of profound interest to them and which they would like to study in depth. The fellows devise their own course of study, including conceptualization, theoretical issues, and relevant academic literature, clarification of positions, analysis of case studies, meetings with key figures, and surveys of relevant organizations. At the end of this process, the fellows will present their research, the areas that they have identified as targets for viable intervention and impact, and their plans for promoting the latter following their graduation from the program.<\/p>\n<p>The axis of “learning by doing” includes support from mentors who are experts in the fields and areas of study selected by the fellows, as well as input from a team of experts who provide specific feedback and advice as needed.<br><br><\/p>\n","images":{"north-connection-5.jpg":{"src":"https:\/\/north.mandelfoundation.org.il\/english\/SiteCollectionImages\/News\/North-Connection-5.jpg","caption":"A meeting of the employment and economic development group (Photo: Dana Kleinman)"},"north-connection-4.jpg":{"src":"https:\/\/north.mandelfoundation.org.il\/english\/SiteCollectionImages\/News\/North-Connection-4.jpg","caption":" A meeting of the health group (Photo: Rinat Pilipp)"}},"attachments":[],"outer_links":[]},"grad-news2022s":{"title":"2022 Mandel Graduation Ceremony Held in Jerusalem","date":"2022-11-17","image":"https:\/\/north.mandelfoundation.org.il\/english\/SiteCollectionImages\/News\/Grad-news2022s.jpg","excerpt":"Graduates of 10 programs of the Mandel Foundation–Israel came together at the Jerusalem Theatre for a joint graduation ceremony\n ","link":"https:\/\/www.mandelfoundation.org.il\/english\/About\/News\/Pages\/Mandel-Graduation-2022.aspx","is_inner":"no","slug":"grad-news2022s"},"sawa-graduate-spotlight-north":{"title":"Mandel Graduates Empower Women in Jisr az-Zarqa","date":"2021-12-12","image":"https:\/\/north.mandelfoundation.org.il\/english\/SiteCollectionImages\/News\/SAWA_s.jpg","excerpt":"An initiative founded by two graduates enables women to gain financial independence through textile design and production ","link":"https:\/\/north.mandelfoundation.org.il\/english\/About\/News\/Pages\/SAWA-graduate-spotlight-north.aspx","is_inner":"yes","slug":"sawa-graduate-spotlight-north","text":"The Arab town of Jisr az-Zarqa in northern Israel, located on the Mediterranean coast between Caesarea and Zichron Yaacov, has a low socio-economic standing and has long suffered from a lack of opportunities for development. In recent years, however, local projects and ventures have sprung including a number of tourist initiative. These include Juha's Guesthouse – a joint project of Ahmad and Haifa Jurban and their partner Neta Henien – and Beachub, an eco-friendly beachfront co-working resort.\nSAWA is a new initiative established in Jisr a-Zarqa by two graduates of Cohort 4 of the Mandel Program for Local Leadership in the North: Celia Jubari, who lives in the Arab town of Kafr Qara, and Michal Sadeh-Goldvasser, who lives in Zichron Yaacov. A social worker and social entrepreneur, Michal is the director of impact at the Mifras Educational Entrepreneurship Incubator and is involved in vocational training for women in Jisr a-Zarqa, while Celia is an educational consultant and the director of Ma'an – The Unit for Students from Arab Society at Shenkar College of Engineering, Design, and Art. Their project is an outgrowth of the Mandel Center for Leadership in the North’s focus on training leaders for the diverse society of Israel’s northern region and is an example of the involvement of graduates in activities that strengthen and advance emerging social processes.\n\nThe fellows chosen to participate in the three leadership programs of the Mandel Center for Leadership in the North each year are social activists and people who hold senior positions in the public sector, local government, and non-profit organizations, who live or work in northern Israel. The Center takes steps to ensure that each group of participants faithfully reflects the diverse composition of the population of the north. The Center believes that leadership develops and is tested by active involvement in challenges in the field; as such, it sees its graduates and their activities as part of the efforts for social change in the North – an area of activity that is constantly being developed.\n\nCelia and Michal recognized the motivation and internal strength of the residents of Jisr az-Zarqa that have enabled the establishment of local initiatives that strengthen the community and encourage its leadership. Together with the women of the town, the two Mandel graduates established a design workshop to create fabric laptop sleeves. To this end, they enlisted Shenkar College – one of Israel’s leading colleges for art and design. In addition to teaching women a craft and involving them in creative work, the workshop collaborates with other tourism projects in the town, and the laptop sleeves are sold as accessories at the Beachub co-working resort.\n\n\nCelia believes that exposing people to design through various tools, such as creating inspiration boards and bringing internal ideas into the workspace, contributes to the development of creative and practical thinking. Michal chooses to relate to the project through the emotional dimension, which is prominent in the meetings of the workshop. As she sees it, it is very important to establish a permanent building where women will be able to meet each other in a context that is equal, shared, and empowering. Michal and Celia share a vision to establish a permanent facility – both physical and human – that will offer a wide range of options and allow each woman to take from it what she can and as much as she wants, knowing that the Center is available to her at all times.\n\n\nIn a field of activity that has many players, ventures such as SAWA open and close all over Israel without making a significant impact. \"In this respect,\" says Celia, \"the Mandel program has made me very focused. Usually, I work laterally, instead of focusing on one thing from beginning to end, as Daphi Biran Singer [director of the Mandel Program for Regional Leadership in the North] always says.\" Celia and Michal both have experience in social entrepreneurship, but they say that the Mandel program gave them confidence and a sense of capability. Without the emergence of internal forces from the field, however, it would have been impossible for them to act. In this regard, graduates of the Mandel Center for Leadership in the North are part of an overall process of impact that enables them to apply leadership practices in order to be part of internal processes that have arisen in the field and to promote them.\nIn addition, the meeting between the two graduates and the close connection between the fellows of their cohort and all the graduates of the Mandel Center for Leadership in the North have served to promote processes in the field. \"This is what enables us to move things in reality,” they say. “It’s thanks to the varied people who attend the Center’s programs.”\nToday, Michal and Celia are creating collaborations with other partners, primarily in the academic world, and are looking for a permanent facility in which to house and expand the activities of the SAWA workshop.\n","html_content":"<p>\n   <img src=\"\/english\/SiteCollectionImages\/News\/SAWA-3.jpg\" alt=\"Women meeting in the workshop (Photo courtesy of Michal Sadeh-Goldvasser and Celia Jubari)\" class=\"img-responsive\">\n   <span class=\"ms-rteStyle-References\">Photo courtesy of Michal Sadeh-Goldvasser and Celia Jubari<br><\/span><br><\/p>\n<p>The Arab town of Jisr az-Zarqa in northern Israel, located on the Mediterranean coast between Caesarea and Zichron Yaacov, has a low socio-economic standing and has long suffered from a lack of opportunities for development. In recent years, however, local projects and ventures have sprung including a number of tourist initiative. These include Juha's Guesthouse&nbsp;– a joint project of Ahmad and Haifa Jurban and their partner Neta Henien – and Beachub, an eco-friendly beachfront co-working resort.<\/p>\n<p>SAWA is a new initiative established in Jisr a-Zarqa by two graduates of Cohort 4 of the Mandel Program for Local Leadership in the North: \n   <strong>Celia Jubari<\/strong>, who lives in the Arab town of Kafr Qara, and \n   <strong>Michal Sadeh-Goldvasser<\/strong>, who lives in Zichron Yaacov.  A social worker and social entrepreneur, Michal is the director of impact at the Mifras Educational Entrepreneurship Incubator and is involved in vocational training for women in Jisr a-Zarqa, while Celia is an educational consultant and the director of Ma'an – The Unit for Students from Arab Society at Shenkar College of Engineering, Design, and Art. Their project is an outgrowth of the Mandel Center for Leadership in the North’s focus on training leaders for the diverse society of Israel’s northern region and is an example of the involvement of graduates in activities that strengthen and advance emerging social processes.<\/p>\n<p> \n   <br> \n<\/p>\n<p> \n   <img src=\"\/english\/SiteCollectionImages\/News\/SAWA_4.jpg\" alt=\"SAWA tag with information about the initiative(Photo courtesy of Michal Sadeh-Goldvasser and Celia Jubari)\" class=\"img-responsive\">\n   <span class=\"ms-rteStyle-References\">Photo courtesy of Michal Sadeh-Goldvasser and Celia Jubari<\/span><br><\/p>\n<p>The fellows chosen to participate in the three leadership programs of the Mandel Center for Leadership in the North each year are social activists and people who hold senior positions in the public sector, local government, and non-profit organizations, who live or work in northern Israel. The Center takes steps to ensure that each group of participants faithfully reflects the diverse composition of the population of the north. The Center believes that leadership develops and is tested by active involvement in challenges in the field; as such, it sees its graduates and their activities as part of the efforts for social change in the North – an area of activity that is constantly being developed. <\/p>\n<p><\/p>\n<p>Celia and Michal recognized the motivation and internal strength of the residents of Jisr az-Zarqa that have enabled the establishment of local initiatives that strengthen the community and encourage its leadership. Together with the women of the town, the two Mandel graduates established a design workshop to create fabric laptop sleeves. To this end, they enlisted Shenkar College – one of Israel’s leading colleges for art and design. In addition to teaching women a craft and involving them in creative work, the workshop collaborates with other tourism projects in the town, and the laptop sleeves are sold as accessories at the Beachub co-working resort.<br><\/p>\n<p> \n   <br> \n<\/p>\n<p><\/p>\n<p><br>Celia believes that exposing people to design through various tools, such as creating inspiration boards and bringing internal ideas into the workspace, contributes to the development of creative and practical thinking. Michal chooses to relate to the project through the emotional dimension, which is prominent in the meetings of the workshop. As she sees it, it is very important to establish a permanent building where women will be able to meet each other in a context that is equal, shared, and empowering. Michal and Celia share a vision to establish a permanent facility – both physical and human – that will offer a wide range of options and allow each woman to take from it what she can and as much as she wants, knowing that the Center is available to her at all times.<br><\/p>\n<p> \n         <br> \n      <\/p>\n<p><\/p>\n<p>In a field of activity that has many players, ventures such as SAWA open and close all over Israel without making a significant impact. \"In this respect,\" says Celia, \"the Mandel program has made me very focused. Usually, I work laterally, instead of focusing on one thing from beginning to end, as Daphi Biran Singer [director of the Mandel Program for Regional Leadership in the North] always says.\" Celia and Michal both have experience in social entrepreneurship, but they say that the Mandel program gave them confidence and a sense of capability. Without the emergence of internal forces from the field, however, it would have been impossible for them to act. In this regard, graduates of the Mandel Center for Leadership in the North are part of an overall process of impact that enables them to apply leadership practices in order to be part of internal processes that have arisen in the field and to promote them.<\/p>\n<p>In addition, the meeting between the two graduates and the close connection between the fellows of their cohort and all the graduates of the Mandel Center for Leadership in the North have served to promote processes in the field. \"This is what enables us to move things in reality,” they say. “It’s thanks to the varied people who attend the Center’s programs.”<\/p>\n<p>Today, Michal and Celia are creating collaborations with other partners, primarily in the academic world, and are looking for a permanent facility in which to house and expand the activities of the SAWA workshop.<br><\/p>\n","images":{"sawa-3.jpg":{"src":"https:\/\/north.mandelfoundation.org.il\/english\/SiteCollectionImages\/News\/SAWA-3.jpg","caption":"Photo courtesy of Michal Sadeh-Goldvasser and Celia Jubari"},"sawa_4.jpg":{"src":"https:\/\/north.mandelfoundation.org.il\/english\/SiteCollectionImages\/News\/SAWA_4.jpg","caption":"Photo courtesy of Michal Sadeh-Goldvasser and Celia Jubari"}},"attachments":[],"outer_links":[]},"mfi-graduation-2021s":{"title":"2021 Mandel Graduation Ceremony Held in Jerusalem","date":"2021-10-17","image":"https:\/\/north.mandelfoundation.org.il\/english\/SiteCollectionImages\/News\/MFI-graduation-2021s.jpg","excerpt":"Graduates of all the Mandel Foundation–Israel’s programs came together for a joint ceremony attended by President Isaac Herzog ","link":"https:\/\/www.mandelfoundation.org.il\/english\/About\/News\/Pages\/Graduation-2021.aspx","is_inner":"no","slug":"mfi-graduation-2021s"},"the-north-presents":{"title":"The North Presents: A Series of Online Meetings","date":"2021-01-10","image":"https:\/\/north.mandelfoundation.org.il\/english\/SiteCollectionImages\/News\/North-hosts-s.jpg","excerpt":"Each session of this series for the Mandel community hosts a leading figure in Israeli public life who discusses issues on the public agenda ","link":"https:\/\/north.mandelfoundation.org.il\/english\/About\/News\/Pages\/The-North-Presents.aspx","is_inner":"yes","slug":"the-north-presents","text":"​In November 2020, the Mandel Center for Leadership in the North launched a series of monthly online meetings with influential figures in Israeli public life. Titled “The North Presents,” the series is open to members of the entire Mandel community – fellows, graduates, faculty, and staff.\nThe first session, which took place on November 24, 2020, featured Shai Nitzan, former state attorney and deputy attorney general for special matters, who spoke about the conflict between maintaining state security and protecting civil rights. Held on Zoom, the meeting was attended by more than 100 fellows, graduates, and employees of the Mandel Foundation–Israel.\nThe second meeting in the series featured Dr. Eliad Shraga, founder and chairman of the Movement for the Quality of Government in Israel, a watchdog organization that is currently spearheading the effort to establish a commission of inquiry into the “submarine affair.”\n","html_content":"<p>​In November 2020, the Mandel Center for Leadership in the North launched a series of monthly online meetings with influential figures in Israeli public life. Titled “The North Presents,” the series is open to members of the entire Mandel community – fellows, graduates, faculty, and staff.<\/p>\n<p>The first session, which took place on November 24, 2020, featured \n   <strong>Shai Nitzan<\/strong>, former state attorney and deputy attorney general for special matters, who spoke about the conflict between maintaining state security and protecting civil rights. Held on Zoom, the meeting was attended by more than 100 fellows, graduates, and employees of the Mandel Foundation–Israel.<\/p>\n<p>The second meeting in the series featured \n   <strong>Dr. Eliad Shraga<\/strong>, founder and chairman of the Movement for the Quality of Government in Israel, a watchdog organization that is currently spearheading the effort to establish a commission of inquiry into the “submarine affair.”<\/p>\n","images":[],"attachments":[],"outer_links":[]},"north-opening-2020":{"title":"Mandel Leadership Programs in the North begin 2020–2021 Year","date":"2020-12-30","image":"https:\/\/north.mandelfoundation.org.il\/english\/SiteCollectionImages\/News\/North-opening-2020-s.jpg","excerpt":"The programs opened in an atmosphere of optimism, despite the difficulties posed by the restrictions of the coronavirus ","link":"https:\/\/north.mandelfoundation.org.il\/english\/About\/News\/Pages\/North-opening-2020.aspx","is_inner":"yes","slug":"north-opening-2020","text":"The three programs at the Mandel Center for Leadership in the North began the activities of the 2020–2021 academic year with a sense of optimism and renewal, despite the restrictions of the coronavirus, while carefully observing the Ministry of Health's COVID-19 regulations. The opening sessions of the three programs introduced the new fellows to the ideas and methods of the Center, to its staff, and to each other.\nIn late October, the Mandel Program for Social Leadership in the North launched its activities on the lawns of Kibbutz Sha’ar Ha’amakim. The first day of studies began with a musical performance by the activist hip-hop group System Ali, which connected fellows through songs in the six different languages that the band's members speak. The fellows also met with Miki Nevo, director of the Mandel Center for Leadership in the North, for an introductory lecture on social entrepreneurship.\nThe second day of the program introduced the fellows to some of the lecturers who will teach them during the year. The fellows participated in sessions that gave them a taste of the content that they will be studying, encouraged discourse on current political issues, built a knowledge base and explored alternatives for policy solutions, and included an inspirational meeting dedicated to topics related to the humanities.\nThe Mandel Program for Public Service Leadership began its activities in November. At the opening session, held outdoors at Kibbutz Hazorea, the fellows participated in roundtable discussions in which they drafted group contracts regarding the nature of discourse and general atmosphere that would characterize the program. Following this, the fellows met with Emi Palmor, former director general of the Ministry of Justice, who shared some of her experiences from her tenure at the Ministry. Miki Nevo, director of the Mandel Center for Leadership in the North, then gave an introductory lecture on management and leadership. Finally, the fellows listened to Miriam Toukan, a singer, lawyer, and political activist who performed songs in Hebrew, Arabic, and English.\nThe launch event of the Mandel Program for Regional Leadership in the North took place in October on Zoom. First, the fellows heard a lecture from Professor Motti Golani, who is the Ruhama Rosenberg Professor for Jewish History and chair of the department of Jewish history at Tel Aviv University, and a faculty member of the Mandel School for Educational Leadership. Professor Golani’s lecture was titled “The past: Is what happened what really happened? On the ‘wall and tower’ settlements, Nir David, and us.”\nAfter the lecture, the fellows split into three separate work groups, each of which met with one of the program mentors in a different \"room\" and discussed a question related to setting expectations at the outset of the program. After collating the summaries of all three groups, the fellows reconvened to present and discuss their insights. In conclusion, the fellows watched a performance by Miriam Toukan and Idan Toledano of the song “When Bialik Meets Fairuz,” which combines the poetry of Haim Nahman Bialik, the music of the Lebanese vocalist Fairuz, klezmer music, and Arab folk music.\n","html_content":"<p>The three programs at the Mandel Center for Leadership in the North began the activities of the 2020–2021 academic year with a sense of optimism and renewal, despite the restrictions of the coronavirus, while carefully observing the Ministry of Health's COVID-19 regulations. The opening sessions of the three programs introduced the new fellows to the ideas and methods of the Center, to its staff, and to each other.<br><br><\/p>\n<p>\n   <img src=\"\/english\/SiteCollectionImages\/News\/North-opening-2020-1.jpg\" alt=\"Mandel Program for Social Leadership in the North\" class=\"img-responsive\">\n   <br>\n<\/p>\n<p>In late October, the \n   <strong>\n      <a href=\"\/english\/Programs\/Pages\/Mandel-Program-for-Social-Leadership-in-the-North.aspx\">Mandel Program for Social Leadership in the North<\/a><\/strong> launched its activities on the lawns of Kibbutz Sha’ar Ha’amakim. The first day of studies began with a musical performance by the activist hip-hop group System Ali, which connected fellows through songs in the six different languages that the band's members speak. The fellows also met with \n   <strong>Miki Nevo<\/strong>, director of the Mandel Center for Leadership in the North, for an introductory lecture on social entrepreneurship.<\/p>\n<p>The second day of the program introduced the fellows to some of the lecturers who will teach them during the year. The fellows participated in sessions that gave them a taste of the content that they will be studying, encouraged discourse on current political issues, built a knowledge base and explored alternatives for policy solutions, and included an inspirational meeting dedicated to topics related to the humanities.<br><br><\/p>\n<p>\n   <img src=\"\/english\/SiteCollectionImages\/News\/North-opening-2020-2.jpg\" alt=\"Mandel Program for Public Service Leadership\" class=\"img-responsive\">\n   <br>\n<\/p>\n<p>The \n   <strong>\n      <a href=\"\/english\/Programs\/Pages\/Mandel-Program-for-Leadership-in-the-Public-Service.aspx\">Mandel Program for Public Service Leadership<\/a><\/strong> began its activities in November. At the opening session, held outdoors at Kibbutz Hazorea, the fellows participated in roundtable discussions in which they drafted group contracts regarding the nature of discourse and general atmosphere that would characterize the program. Following this, the fellows met with \n   <strong>Emi Palmor<\/strong>, former director general of the Ministry of Justice, who shared some of her experiences from her tenure at the Ministry. \n   <strong>Miki Nevo<\/strong>, director of the Mandel Center for Leadership in the North, then gave an introductory lecture on management and leadership. Finally, the fellows listened to \n   <strong>Miriam Toukan<\/strong>, a singer, lawyer, and political activist who performed songs in Hebrew, Arabic, and English.<br><br><\/p>\n<p>\n   <img src=\"\/english\/SiteCollectionImages\/News\/North-opening-2020-3.jpg\" alt=\"Mandel Program for Regional Leadership in the North\" class=\"img-responsive\">\n   <br>\n<\/p>\n<p>The launch event of the \n   <strong>\n      <a href=\"\/english\/Programs\/Pages\/Mandel-Program-for-Regional-Leadership-in-the-North.aspx\">Mandel Program for Regional Leadership in the North<\/a><\/strong> took place in October on Zoom. First, the fellows heard a lecture from<strong> Professor Motti Golani<\/strong>, who is the Ruhama Rosenberg Professor for Jewish History and chair of the department of Jewish history at Tel Aviv University, and a faculty member of the Mandel School for Educational Leadership. Professor Golani’s lecture was titled “The past: Is what happened what really happened? On the ‘wall and tower’ settlements, Nir David, and us.”<\/p>\n<p>After the lecture, the fellows split into three separate work groups, each of which met with one of the program mentors in a different \"room\" and discussed a question related to setting expectations at the outset of the program. After collating the summaries of all three groups, the fellows reconvened to present and discuss their insights. In conclusion, the fellows watched a performance by \n   <strong>Miriam Toukan<\/strong> and \n   <strong>Idan Toledano<\/strong> of the song “When Bialik Meets Fairuz,” which combines the poetry of Haim Nahman Bialik, the music of the Lebanese vocalist Fairuz, klezmer music, and Arab folk music.<\/p>\n","images":{"north-opening-2020-1.jpg":{"src":"https:\/\/north.mandelfoundation.org.il\/english\/SiteCollectionImages\/News\/North-opening-2020-1.jpg","caption":""},"north-opening-2020-2.jpg":{"src":"https:\/\/north.mandelfoundation.org.il\/english\/SiteCollectionImages\/News\/North-opening-2020-2.jpg","caption":""},"north-opening-2020-3.jpg":{"src":"https:\/\/north.mandelfoundation.org.il\/english\/SiteCollectionImages\/News\/North-opening-2020-3.jpg","caption":""}},"attachments":[],"outer_links":[{"title":"Mandel Program for Social Leadership in the North","url":"https:\/\/north.mandelfoundation.org.il\/english\/Programs\/Pages\/Mandel-Program-for-Social-Leadership-in-the-North.aspx"},{"title":"Mandel Program for Public Service Leadership","url":"https:\/\/north.mandelfoundation.org.il\/english\/Programs\/Pages\/Mandel-Program-for-Leadership-in-the-Public-Service.aspx"},{"title":"Mandel Program for Regional Leadership in the North","url":"https:\/\/north.mandelfoundation.org.il\/english\/Programs\/Pages\/Mandel-Program-for-Regional-Leadership-in-the-North.aspx"}]},"north-graduates-2020-aspx":{"title":"Mandel Center in North Holds Second Graduates Conference","date":"2020-08-10","image":"https:\/\/north.mandelfoundation.org.il\/english\/SiteCollectionImages\/News\/grads2020s.jpg","excerpt":"The virtual conference centered on the theme of “participationism,” and was attended by 86 graduates via Zoom ","link":"https:\/\/north.mandelfoundation.org.il\/english\/About\/News\/Pages\/north-graduates-2020-aspx.aspx","is_inner":"yes","slug":"north-graduates-2020-aspx","text":"On Monday, August 10, the Mandel Center for Leadership in the North held its second annual graduates conference. Held on the Zoom videoconferencing platform, the event was opened by the Center's outgoing director, Professor David Dery, and by Eviatar Baksis, a graduate of Cohort 2 of the Center's Mandel Program for Regional Leadership in the North, who represented the graduates’ steering committee. \nFollowing the two opening addresses, the participants watched a series of short presentations from graduates and entrepreneurs who showcased their activities, focusing on the question, “How do you turn a personal dream into a social enterprise that brings together partners and impacts society?” In addition, Miki Nevo, the incoming director of the Center congratulated the graduates and explained how the Mandel Foundation's relationship with its graduates in Israel is currently being addressed by the Foundation in general, and by the Center in the North in particular.\nNext, the following presentations were made:\nFollowing this, each of the lecturers hosted a smaller Zoom group with participating graduates, who chose which group to attend in accordance with their individual area of interest. These groups discussed the matter in depth and explored the conditions that promote collaborative enterprises. Following the discussion, the insights from each group were shared with the full plenum using Padlet software.\nIn addition, the participants took part in three rounds of “World Coffee,” and held a discussion focusing on the question, “How do we create a participatory graduate community that will promote initiatives and activity in the North?” This was followed by a lecture on the meaning of participatory leadership by Shani Marchevsky, the founder of Hatribuna, a platform for participatory leadership in the social and private sectors.\nThe conference was organized by Daphi Biran Singer, director of the Mandel Program for Regional Leadership in the North; Liraz Maanit, graduate coordinator and coordinator of the Mandel Program for Leadership in the Public Service; pedagogy expert Revital Yahalom, a graduate of Cohort 20 of the Mandel School for Educational Leadership; and visiting faculty member Professor Ruth Margalit.\n","html_content":"<p>\n   <img src=\"\/english\/SiteCollectionImages\/News\/grads-2020.jpg\" alt=\"Mandel Center for Leadership in the North Holds Second Graduates Conference\" class=\"img-responsive\">​<\/p>\n<p>On Monday, August 10, the Mandel Center for Leadership in the North held its second annual graduates conference. Held on the Zoom videoconferencing platform, the event was opened by the Center's outgoing director, \n   <strong>Professor David Dery<\/strong>, and by \n   <strong>Eviatar Baksis<\/strong>, a graduate of Cohort 2 of the Center's Mandel Program for Regional Leadership in the North, who represented the graduates’ steering committee.&nbsp;<br><\/p>\n<p>Following the two opening addresses, the participants watched a series of short presentations from graduates and entrepreneurs who showcased their activities, focusing on the question, “How do you turn a personal dream into a social enterprise that brings together partners and impacts society?” In addition, \n   <strong>Miki Nevo<\/strong>, the incoming director of the Center congratulated the graduates and explained how the Mandel Foundation's relationship with its graduates in Israel is currently being addressed by the Foundation in general, and by the Center in the North in particular.<\/p>\n<p>Next, the following presentations were made:<\/p>\n<p>Following this, each of the lecturers hosted a smaller Zoom group with participating graduates, who chose which group to attend in accordance with their individual area of interest. These groups discussed the matter in depth and explored the conditions that promote collaborative enterprises. Following the discussion, the insights from each group were shared with the full plenum using Padlet software.<\/p>\n<p>In addition, the participants took part in three rounds of “World Coffee,” and held a discussion focusing on the question, “How do we create a participatory graduate community that will promote initiatives and activity in the North?” This was followed by a lecture on the meaning of participatory leadership by <strong>Shani Marchevsky<\/strong>, the founder of Hatribuna, a platform for participatory leadership in the social and private sectors.<\/p>\n<p>The conference was organized by <strong>Daphi Biran Singer<\/strong>, director of the Mandel Program for Regional Leadership in the North; \n   <strong>Liraz Maanit<\/strong>, graduate coordinator and coordinator of the Mandel Program for Leadership in the Public Service; pedagogy expert \n   <strong>Revital Yahalom<\/strong>, a graduate of Cohort 20 of the Mandel School for Educational Leadership; and visiting faculty member \n   <strong>Professor Ruth Margalit<\/strong>.<br><\/p>\n","images":{"grads-2020.jpg":{"src":"https:\/\/north.mandelfoundation.org.il\/english\/SiteCollectionImages\/News\/grads-2020.jpg","caption":""}},"attachments":[],"outer_links":[]},"umm-al-fahm-2019":{"title":"Public Service Fellows Participate in a Field Trip to Umm al-Fahm","date":"2019-12-10","image":"https:\/\/north.mandelfoundation.org.il\/english\/SiteCollectionImages\/News\/Umm-al-Fahm-2019_s.jpeg","excerpt":"Fellows of Cohort 1 of the Mandel Program for Leadership in the Public Service enhanced their knowledge of Arab society ","link":"https:\/\/north.mandelfoundation.org.il\/english\/About\/News\/Pages\/Umm-al-Fahm-2019.aspx","is_inner":"yes","slug":"umm-al-fahm-2019","text":"Fellows of the first cohort of the Mandel Program for Leadership in the Public Service participated in a field trip designed to enhance their familiarity with Arab society, which introduced them to sociologist Professor Khaled Abu-Asbeh, nonprofit director Uri Kandel, and Samir Mahamid, the mayor of Umm al-Fahm.\nAt the start of the study tour, the fellows and faculty of the program visited the Umm al-Fahm Art Gallery. Founded in 1996 by the artist Said Abu Shakra, the gallery showcases contemporary Arab art.\nNext, the fellows met with sociologist Professor Khaled Abu-Asbeh and discussed Arab society as a society undergoing change and crisis. Professor Abu-Asbeh explained that various social and cultural patterns that endured for generations are now dying out, and this is enabling Arabs in Israel to integrate into Israeli society both economically and socially. As he explained, one of the main changes in this context is related to the place of women in Arab society; the role of women in society is becoming more dominant than in the past as more and more women receive an academic education and enter positions of influence.\nAlongside positive and optimistic developments, Professor Abu-Asbeh also noted the emergence of various crises in family life and in the family unit in the Arab sector: Arabic public education is being eroded, while private education is flourishing; government policies regarding education in the Arab sector are being set without consultation with Arab society; and young adults who work in hi-tech are leaving their villages and towns and are not investing in life there. The possible solutions suggested for these challenges included strengthening civic society so that it is better able to work within and on behalf of Arab society; changing the organizational culture in local government; and increasing government involvement.\nNext, the fellows met with Uri Kandel, executive director of Shared Paths, a joint Jewish-Arab nonprofit that operates locally-guided tours of Arab towns throughout Israel in order to introduce people to Arab society. Through these tours, the organization aims to educate visitors about the history of Arab society and the challenges it faces today, as well as to enable them to appreciate the rich cultural diversity of Arab society.\nAt the Umm al-Fahm municipality, the fellows met with Mayor Dr. Samir Mahamid, who left his career in education to enter politics. Dr. Mahamid presented the difficulties he faces as mayor, which include the need to combat violence, transportation problems, improving education, improving the city’s public image, and more, both on a national level (e.g., government bureaucracy and budgets) and on a local level. He also noted the traditional power of the hamula in Arab society as a barrier to change.\nIn closing, the participants discussed their experiences over the course of the day. They focused on the gap between the city’s image and what is actually happening on the ground; their lack of familiarity with different societies; the impact of the human tendency toward generalization; the fear of the unknown; and the fact that we are all heavily influenced by the media, which chooses to present only the extremes.\n","html_content":"<p><br>Fellows of the first cohort of the Mandel Program for Leadership in the Public Service participated in a field trip designed to enhance their familiarity with Arab society, which introduced them to sociologist <strong>Professor Khaled Abu-Asbeh<\/strong>, nonprofit director <strong>Uri Kandel<\/strong>, and <strong>Samir Mahamid<\/strong>, the mayor of Umm al-Fahm.<\/p>\n<p>At the start of the study tour, the fellows and faculty of the program visited the Umm al-Fahm Art Gallery.  Founded in 1996 by the artist Said Abu Shakra, the gallery showcases contemporary Arab art.<\/p>\n<p>Next, the fellows met with sociologist <strong>Professor Khaled Abu-Asbeh<\/strong> and discussed Arab society as a society undergoing change and crisis. Professor Abu-Asbeh explained that various social and cultural patterns that endured for generations are now dying out, and this is enabling Arabs in Israel to integrate into Israeli society both economically and socially. As he explained, one of the main changes in this context is related to the place of women in Arab society; the role of women in society is becoming more dominant than in the past as more and more women receive an academic education and enter positions of influence.<\/p>\n<p>Alongside positive and optimistic developments, Professor Abu-Asbeh also noted the emergence of various crises in family life and in the family unit in the Arab sector: Arabic public education is being eroded, while private education is flourishing; government policies regarding education in the Arab sector are being set without consultation with Arab society; and young adults who work in hi-tech are leaving their villages and towns and are not investing in life there. The possible solutions suggested for these challenges included strengthening civic society so that it is better able to work within and on behalf of Arab society; changing the organizational culture in local government; and increasing government involvement.<br><br><\/p>\n<p><img src=\"\/English\/SiteCollectionImages\/News\/Umm-al-Fahm-2019-1.jpeg\" alt=\" Public Service Fellows Participate in a Field Trip to Umm al-Fahm\" class=\"img-responsive\"><br><\/p>\n<p>Next, the fellows met with <strong>Uri Kandel<\/strong>, executive director of Shared Paths, a joint Jewish-Arab nonprofit that operates locally-guided tours of Arab towns throughout Israel in order to introduce people to Arab society. Through these tours, the organization aims to educate visitors about the history of Arab society and the challenges it faces today, as well as to enable them to appreciate the rich cultural diversity of Arab society.<\/p>\n<p>At the Umm al-Fahm municipality, the fellows met with <strong>Mayor Dr. Samir Mahamid<\/strong>, who left his career in education to enter politics. Dr. Mahamid presented the difficulties he faces as mayor, which include the need to combat violence, transportation problems, improving education, improving the city’s public image, and more, both on a national level (e.g., government bureaucracy and budgets) and on a local level. He also noted the traditional power of the hamula in Arab society as a barrier to change. <\/p>\n<p>In closing, the participants discussed their experiences over the course of the day. They focused on the gap between the city’s image and what is actually happening on the ground; their lack of familiarity with different societies; the impact of the human tendency toward generalization; the fear of the unknown; and the fact that we are all heavily influenced by the media, which chooses to present only the extremes.<br><br> <\/p>\n<p><img src=\"\/English\/SiteCollectionImages\/News\/Umm-al-Fahm-2019.jpeg\" alt=\" Public Service Fellows Participate in a Field Trip to Umm al-Fahm\" class=\"img-responsive\"><br><\/p>\n","images":{"umm-al-fahm-2019-1.jpeg":{"src":"https:\/\/north.mandelfoundation.org.il\/English\/SiteCollectionImages\/News\/Umm-al-Fahm-2019-1.jpeg","caption":""},"umm-al-fahm-2019.jpeg":{"src":"https:\/\/north.mandelfoundation.org.il\/English\/SiteCollectionImages\/News\/Umm-al-Fahm-2019.jpeg","caption":""}},"attachments":[],"outer_links":[]},"mandel-memorial-service-en_s":{"title":"Memorial Service for Morton L. Mandel","date":"2019-10-20","image":"https:\/\/north.mandelfoundation.org.il\/english\/SiteCollectionImages\/News\/Mandel-Memorial-Service-En_s.jpg","excerpt":"The memorial service conducted in Cleveland for Morton L. Mandel was broadcast live on October 20, 2019, at 1:00 pm Eastern Time and 8:00 pm Israel time. Click here to view ","link":"https:\/\/youtu.be\/vXEACNbcEz0","is_inner":"no","slug":"mandel-memorial-service-en_s"},"morton-l-mandel-1921-2019es":{"title":"Morton L. Mandel, 1921-2019","date":"2019-10-17","image":"https:\/\/north.mandelfoundation.org.il\/english\/SiteCollectionImages\/News\/morton-l-mandel-1921-2019es.jpg","excerpt":"The Mandel Center for Leadership in the North mourns the loss of Morton L. Mandel, an extraordinary leader, passionate Zionist, generous philanthropist, and man of vision ","link":"https:\/\/www.mandelfoundation.org.il\/english\/About\/News\/Pages\/The-Mandel-Foundation-Mourns-the-Loss-of-Morton-L-Mandel.aspx","is_inner":"no","slug":"morton-l-mandel-1921-2019es"},"2019-graduation_s":{"title":"2019 Mandel Graduation Ceremony Held in Jerusalem","date":"2019-09-23","image":"https:\/\/north.mandelfoundation.org.il\/english\/SiteCollectionImages\/News\/2019-Graduation_s.jpg","excerpt":"Graduates of all Mandel programs in Israel who completed their studies in 2019 came together to celebrate in a shared ceremony ","link":"https:\/\/north.mandelfoundation.org.il\/_layouts\/Mandel13\/Internet\/RedirectTo.aspx?ID=MFI\/english\/About\/News\/Pages\/2019-Mandel-Graduation.aspx","is_inner":"no","slug":"2019-graduation_s"},"act-of-leadership-2019":{"title":"Fellows Present Products of Act of Leadership Workshop","date":"2019-04-14","image":"https:\/\/north.mandelfoundation.org.il\/english\/SiteCollectionImages\/News\/Act-of-leadership-2019_s.JPG","excerpt":"Fellows of the Center's regional leadership program presented the subjects they wrote about for their workshop with Professor David Dery\n ","link":"https:\/\/north.mandelfoundation.org.il\/english\/About\/News\/Pages\/act-of-leadership-2019.aspx","is_inner":"yes","slug":"act-of-leadership-2019","text":"​At the heart of the leadership programs conducted by the Mandel Center for Leadership in the North are the clarification of the question of leadership and its implications for the lives of the fellows, as well as critical examination of accepted concepts and paradigms relating to the concept of leadership. These questions and concepts are explored in a workshop taught by the Center’s director, Professor David Dery. The course introduces the fellows to the idea of the “act of leadership” – a central paradigm in the rationale of the Center’s programs.\nAt the end of the course, each fellow selects an “act of leadership” that he or she finds particularly interesting, studies it using the concepts and theories studied, and presents it to the other fellows and the faculty of the Center.\n","html_content":"<p>​At the heart of the leadership programs conducted by the Mandel Center for Leadership in the North are the clarification of the question of leadership and its implications for the lives of the fellows, as well as critical examination of accepted concepts and paradigms relating to the concept of leadership. These questions and concepts are explored in a workshop taught by the Center’s director, \n   <strong>Professor David Dery<\/strong>. The course introduces the fellows to the idea of the “act of leadership” – a central paradigm in the rationale of the Center’s programs.<\/p>\n<p>At the end of the course, each fellow selects an “act of leadership” that he or she finds particularly interesting, studies it using the concepts and theories studied, and presents it to the other fellows and the faculty of the Center.<br><br><\/p>\n<p>\n   <img src=\"\/english\/SiteCollectionImages\/News\/Act-of-leadership-2019.JPG\" alt=\"Regional Leadership Fellows Present Products of Act of Leadership Workshop\" class=\"img-responsive\">&nbsp;<br>The acts of leadership that the fellows of the Mandel Program for Regional Leadership in the North chose to present this year come from a diverse range of fields in Israeli society and around the world. They include:<\/p>\n","images":{"act-of-leadership-2019.jpg":{"src":"https:\/\/north.mandelfoundation.org.il\/english\/SiteCollectionImages\/News\/Act-of-leadership-2019.JPG","caption":""}},"attachments":[],"outer_links":[]},"ramla-lod-2019":{"title":"Regional Leadership Fellows Visit Ramla and Lod","date":"2019-04-04","image":"https:\/\/north.mandelfoundation.org.il\/english\/SiteCollectionImages\/News\/Ramla-Lod-2019_s.jpg","excerpt":"The study tour explored the complex social issues of the two cities, and included meetings with public officials and a visit to a school ","link":"https:\/\/north.mandelfoundation.org.il\/english\/About\/News\/Pages\/Ramla-Lod-2019.aspx","is_inner":"yes","slug":"ramla-lod-2019","text":"​In April 2019, the fellows of the Mandel Program for Regional Leadership in the North participated in a study tour to learn about social enterprises and initiatives in Ramla and Lod. These two cities face multiple challenges and are home to diverse populations who inhabit the same spaces. \nAs part of the program’s emphasis on “peer learning,\" the tour was led by two fellows of the program who are senior police officers and social activists. During the tour, the Mandel fellows were introduced to various perspectives and complexities concerning the relations between citizens and the police in Ramla and Lod, as well as to attempts to forge a stable community, supported by the cities’ appointed leaders, social activists, and community police forces.\nThe fellows met with Yair Revivo, the mayor of Lod, and Aharon Attias, the director general of the Lod municipality. They described the challenges of running a city with a unique mix of populations – Arabs and Jews, religious and secular, new residents and old-timers – as well as a Haredi neighborhood and large numbers of new immigrants. The fellows then visited the old city of Lod and toured its historical sites.\nSubsequently, the fellows visited the ORT comprehensive Arab school in Ramla and met with the school’s principal, Rabab Nasser, who received the President of Israel’s “Israeli Hope in Education” Award for 2016–2017 and the ORT Network Education Award for 2017–2018. In the ORT school, Rabab successfully operates the “shared education” model, which Professor Tony Gallagher developed in Northern Ireland against the backdrop of years of conflict between Catholics and Protestants.\nDuring the day, the fellows met with leading community figures and representatives of the Israel Police, saw examples of social enterprises and initiatives, and learned about the depth and complexity of social issues in the two cities. The effect of the tour continues to have an impact on the program and on the open dialogue among the fellows about Israeli society.\n","html_content":"<p>​In April 2019, the fellows of the Mandel Program for Regional Leadership in the North participated in a study tour to learn about social enterprises and initiatives in Ramla and Lod. These two cities face multiple challenges and are home to diverse populations who inhabit the same spaces.&nbsp;<\/p>\n<p>As part of the program’s emphasis on “peer learning,\" the tour was led by two fellows of the program who are senior police officers and social activists. During the tour, the Mandel fellows were introduced to various perspectives and complexities concerning the relations between citizens and the police in Ramla and Lod, as well as to attempts to forge a stable community, supported by the cities’ appointed leaders, social activists, and community police forces.<br><br><\/p>\n<p>\n   <img src=\"\/english\/SiteCollectionImages\/News\/Ramla-Lod-2019.jpg\" alt=\"Mandel Regional Leadership Fellows Participated in Study Tour of Ramla and Lod\" class=\"img-responsive\">\n   <br>\n<\/p>\n<p>The fellows met with \n   <strong>Yair Revivo<\/strong>, the mayor of Lod, and \n   <strong>Aharon Attias<\/strong>, the director general of the Lod municipality. They described the challenges of running a city with a unique mix of populations – Arabs and Jews, religious and secular, new residents and old-timers – as well as a Haredi neighborhood and large numbers of new immigrants. The fellows then visited the old city of Lod and toured its historical sites.<\/p>\n<p>Subsequently, the fellows visited the ORT comprehensive Arab school in Ramla and met with the school’s principal, \n   <strong>Rabab Nasser<\/strong>, who received the President of Israel’s “Israeli Hope in Education” Award for 2016–2017 and the ORT Network Education Award for 2017–2018. In the ORT school, Rabab successfully operates the “shared education” model, which Professor Tony Gallagher developed in Northern Ireland against the backdrop of years of conflict between Catholics and Protestants.<br><\/p>\n<p>During the day, the fellows met with leading community figures and representatives of the Israel Police, saw examples of social enterprises and initiatives, and learned about the depth and complexity of social issues in the two cities. The effect of the tour continues to have an impact on the program and on the open dialogue among the fellows about Israeli society.<br><br><\/p>\n","images":{"ramla-lod-2019.jpg":{"src":"https:\/\/north.mandelfoundation.org.il\/english\/SiteCollectionImages\/News\/Ramla-Lod-2019.jpg","caption":""}},"attachments":[],"outer_links":[]},"daphni-leef-2019":{"title":"Daphni Leef Visits the Mandel Center in the North","date":"2019-03-11","image":"https:\/\/north.mandelfoundation.org.il\/english\/SiteCollectionImages\/News\/Daphni-Leef-2019_s.jpg","excerpt":"A leader of the 2011 social protest in Israel, Daphni Leef met with faculty and fellows of the Mandel Center for Leadership in the North ","link":"https:\/\/north.mandelfoundation.org.il\/english\/About\/News\/Pages\/Daphni-Leef-2019.aspx","is_inner":"yes","slug":"daphni-leef-2019","text":"​Daphni Leef’s meeting with the faculty and fellows of the Mandel Center for Leadership in the North opened with the documentary movie Before My Feet Touch the Ground, which she directed. Selected to open the DocAviv film festival in 2017, the movie documents the emergence of the social protest in Israel in 2011 and its struggle to lower the cost of living and change the distribution of resources in Israel. The film combines video reportage and interviews that provide a record of the days before and during the protest, and reveal the planning and lack of planning as the protest progressed. \nDaphni Leef, a social activist and one of the leaders of Israel’s social protest in 2011, uses the movie to give a personal reckoning of the events that shook Israeli society at that time, and to come to terms with her own issues.\nAfter the movie, Daphni spoke about how she coped during the days, months, and years after the protest, when she became a prominent public figure and a household name in Israel because of her social activism. She answered questions from the fellows candidly, and with great openness, describing the criticism she faced due to the choices she made and continues to make, as a social entrepreneur grappling with social issues and leadership issues. \nThe encounter was inspirational for the fellows, and raised many questions about the nature of protests and revolutions, of success and failure, and of acts of leadership.\n\n","html_content":"<p><strong>​Daphni Leef<\/strong>’s meeting with the faculty and fellows of the Mandel Center for Leadership in the North opened with the documentary movie \n   <em>Before My Feet Touch the Ground<\/em>, which she directed. Selected to open the DocAviv film festival in 2017, the movie documents the emergence of the social protest in Israel in 2011 and its struggle to lower the cost of living and change the distribution of resources in Israel. The film combines video reportage and interviews that provide a record of the days before and during the protest, and reveal the planning and lack of planning as the protest progressed.&nbsp;<\/p>\n<p>Daphni Leef, a social activist and one of the leaders of Israel’s social protest in 2011, uses the movie to give a personal reckoning of the events that shook Israeli society at that time, and to come to terms with her own issues.<\/p>\n<p>After the movie, Daphni spoke about how she coped during the days, months, and years after the protest, when she became a prominent public figure and a household name in Israel because of her social activism. She answered questions from the fellows candidly, and with great openness, describing the criticism she faced due to the choices she made and continues to make, as a social entrepreneur grappling with social issues and leadership issues.&nbsp;<\/p>\n<p>The encounter was inspirational for the fellows, and raised many questions about the nature of protests and revolutions, of success and failure, and of acts of leadership.<br><br><\/p>\n<p>\n   <img src=\"\/english\/SiteCollectionImages\/News\/Daphni-Leef-2019.jpg\" class=\"img-responsive\" alt>\n   <br>\n<\/p>\n<p>\n   <br>\n<\/p>\n","images":{"daphni-leef-2019.jpg":{"src":"https:\/\/north.mandelfoundation.org.il\/english\/SiteCollectionImages\/News\/Daphni-Leef-2019.jpg","caption":""}},"attachments":[],"outer_links":[]},"gush-etzion-2019":{"title":"Social Leadership Fellows Visit Gush Etzion","date":"2019-02-13","image":"https:\/\/north.mandelfoundation.org.il\/english\/SiteCollectionImages\/News\/Gush-Etzion_s.jpg","excerpt":"The study tour exposed fellows of the Mandel Program for Social Leadership to life beyond the Green Line and in religious Zionist yeshivot ","link":"https:\/\/north.mandelfoundation.org.il\/english\/About\/News\/Pages\/Gush-Etzion-2019.aspx","is_inner":"yes","slug":"gush-etzion-2019","text":"​In mid-February, the fellows of the Mandel Center for Leadership in the North's Program for Social Leadership embarked on a field trip to Gush Etzion, in order to see first-hand the realities of life beyond the Green Line, and to be exposed to the world of the religious Zionist yeshivot. The trip was organized and led by Netanel Afek, one of the program's fellows, as part of the program’s “peer learning” component, which enables fellows to share ideas, knowledge, and personal and professional expertise with each other. \nAs part of their study tour, the fellows visited the “Shorashim” initiative, where they met with Ali Abu Awad and Hadassah Froman, who are working to foster Israeli-Palestinian dialogue and promote peaceful and respectful coexistence. \nFrom there, the fellows traveled to the Har Etzion yeshiva and learned about its \"hesder\" program, which combines extensive Torah study with military service. Their visit to the yeshiva was led by Rabbi Yaakov Medan, one of the heads of the yeshiva, who co-authored the Gavison-Medan Covenant, a proposal for a new arrangement for religion and state in Israel.\nIn Kfar Etzion, a religious kibbutz, the fellows watched an audio-visual presentation that tells the story of Kfar Etzion and the surrounding Etzion Bloc in the pre-state era. At the end of their visit, they met with Yaron Rosenthal, the principal of the Kfar Etzion field school, who spoke about attempts to facilitate shared living between Jews and Palestinians in the area.\nThe field trip was both instructional and challenging, exposing the fellows to different realities of life and sparking extensive discussion upon their return to the Mandel Center for Leadership in the North.\n","html_content":"<p>​In mid-February, the fellows of the Mandel Center for Leadership in the North's Program for Social Leadership embarked on a field trip to Gush Etzion, in order to see first-hand the realities of life beyond the Green Line, and to be exposed to the world of the religious Zionist yeshivot. The trip was organized and led by \n   <strong>Netanel Afek<\/strong>, one of the program's fellows, as part of the program’s “peer learning” component, which enables fellows to share ideas, knowledge, and personal and professional expertise with each other.&nbsp;<\/p>\n<p>As part of their study tour, the fellows visited the “Shorashim” initiative, where they met with \n   <strong>Ali Abu Awad<\/strong> and \n   <strong>Hadassah Froman<\/strong>, who are working to foster Israeli-Palestinian dialogue and promote peaceful and respectful coexistence.&nbsp;<\/p>\n<p>From there, the fellows traveled to the Har Etzion yeshiva and learned about its \"hesder\" program, which combines extensive Torah study with military service. Their visit to the yeshiva was led by \n   <strong>Rabbi Yaakov Medan<\/strong>, one of the heads of the yeshiva, who co-authored the Gavison-Medan Covenant, a proposal for a new arrangement for religion and state in Israel.<\/p>\n<p>In Kfar Etzion, a religious kibbutz, the fellows watched an audio-visual presentation that tells the story of Kfar Etzion and the surrounding Etzion Bloc in the pre-state era. At the end of their visit, they met with \n   <strong>Yaron Rosenthal<\/strong>, the principal of the Kfar Etzion field school, who spoke about attempts to facilitate shared living between Jews and Palestinians in the area.<\/p>\n<p>The field trip was both instructional and challenging, exposing the fellows to different realities of life and sparking extensive discussion upon their return to the Mandel Center for Leadership in the North.<br><br><\/p>\n<p>\n   <img src=\"\/english\/SiteCollectionImages\/News\/Gush-Etzion.jpg\" alt=\"Social Leadership Fellows Visit Gush Etzion\" class=\"img-responsive\"><br><\/p>\n","images":{"gush-etzion.jpg":{"src":"https:\/\/north.mandelfoundation.org.il\/english\/SiteCollectionImages\/News\/Gush-Etzion.jpg","caption":""}},"attachments":[],"outer_links":[]},"north-federation-2019":{"title":"Joint Session with American Mandel Executive Leadership Fellows","date":"2019-01-22","image":"https:\/\/north.mandelfoundation.org.il\/english\/SiteCollectionImages\/News\/North-federation-2019s.jpg","excerpt":"The encounter with fellows of the Mandel regional and social leadership programs in the North included tours of Akko and Upper Nazareth ","link":"https:\/\/north.mandelfoundation.org.il\/english\/About\/News\/Pages\/North-federation-2019.aspx","is_inner":"yes","slug":"north-federation-2019","text":"​In January 2019, the fellows of the Regional Leadership and Social Leadership programs at the Mandel Center for Leadership in the North met with visiting fellows of the Mandel Executive Leadership Program for Federation and Jewish community professionals from the United States, led by Professor Ted Sasson. As part of their program, the American fellows had studied the complexities of Israeli society. The goal of the visit to Israel was to learn in greater depth about the relations between different populations, and about new possibilities and social enterprises and activities that are creating partnerships and opportunities for social change in northern Israel.\nFollowing an experiential introductory session, the fellows of the Executive Leadership Program met with Professor David Dery, director of the Mandel Center for Leadership in the North, who described the programs and the work of the Center, and raised questions that challenge paradigms of thinking about issues of equality and the periphery.\nNext, the fellows of the Israeli and American programs split up into two mixed groups and embarked on a day of site visits to two northern cities with diverse populations: Akko and Upper Nazareth.\nIn Akko, an educational tour introduced them to the city, its complexities, and its history, and presented future trends that offer opportunities for growth and change. The fellows met with leading figures in the city, and were introduced to the entrepreneurial work of the Ma’aseh nonprofit organization, which operates a mixed youth club in the city for Arabs and Jews. This was followed by a discussion that explored questions concerning coexistence between the different population groups in Akko.\nIn Upper Nazareth, the fellows met with members of an urban kibbutz who lead cultural encounters, study groups, and partnerships on social issues, with the aim of creating an engaged and diverse community and facilitating dialogue between different population groups in the city. The activities of the kibbutz focus on the Atzmon School, where its members work as part of the school’s educational faculty. \nAfter the site visits, the fellows took part in discussion groups in which they processed their experiences and learning, and formulated questions for future study. The seminar closed with mutual expressions of desire to continue collaboration between the Mandel Center for Leadership in the North and the Mandel Executive Leadership Program in the United States.\n","html_content":"<p>​In January 2019, the fellows of the Regional Leadership and Social Leadership programs at the Mandel Center for Leadership in the North met with visiting fellows of the Mandel Executive Leadership Program for Federation and Jewish community professionals from the United States, led by<strong> Professor Ted Sasson<\/strong>. As part of their program, the American fellows had studied the complexities of Israeli society. The goal of the visit to Israel was to learn in greater depth about the relations between different populations, and about new possibilities and social enterprises and activities that are creating partnerships and opportunities for social change in northern Israel.<\/p>\n<p>Following an experiential introductory session, the fellows of the Executive Leadership Program met with \n   <strong>Professor David Der<\/strong><strong>y<\/strong>, director of the Mandel Center for Leadership in the North, who described the programs and the work of the Center, and raised questions that challenge paradigms of thinking about issues of equality and the periphery.<\/p>\n<p>Next, the fellows of the Israeli and American programs split up into two mixed groups and embarked on a day of site visits to two northern cities with diverse populations: Akko and Upper Nazareth.<br><br><\/p>\n<p>\n   <img src=\"\/english\/SiteCollectionImages\/News\/North-federation-2019.jpg\" alt=\"Mandel Center Hosts American Mandel Executive Leadership Fellows\" class=\"img-responsive\">\n   <br>\n<\/p>\n<p>In Akko, an educational tour introduced them to the city, its complexities, and its history, and presented future trends that offer opportunities for growth and change. The fellows met with leading figures in the city, and were introduced to the entrepreneurial work of the \n   <strong>Ma’aseh<\/strong> nonprofit organization, which operates a mixed youth club in the city for Arabs and Jews. This was followed by a discussion that explored questions concerning coexistence between the different population groups in Akko.<\/p>\n<p>In Upper Nazareth, the fellows met with members of an \n   <strong>urban kibbutz<\/strong> who lead cultural encounters, study groups, and partnerships on social issues, with the aim of creating an engaged and diverse community and facilitating dialogue between different population groups in the city. The activities of the kibbutz focus on the<strong> Atzmon School<\/strong>, where its members work as part of the school’s educational faculty.&nbsp;<\/p>\n<p>After the site visits, the fellows took part in discussion groups in which they processed their experiences and learning, and formulated questions for future study. The seminar closed with mutual expressions of desire to continue collaboration between the Mandel Center for Leadership in the North and the Mandel Executive Leadership Program in the United States.<br><\/p>\n","images":{"north-federation-2019.jpg":{"src":"https:\/\/north.mandelfoundation.org.il\/english\/SiteCollectionImages\/News\/North-federation-2019.jpg","caption":""}},"attachments":[],"outer_links":[]},"business-conference-2018":{"title":"Mandel Social Leadership Fellows Attend Israel Business Conference","date":"2018-12-19","image":"https:\/\/north.mandelfoundation.org.il\/english\/SiteCollectionImages\/News\/North-business-conference_s.jpg","excerpt":"Fellows of the Mandel Program for Social Leadership in the North attended the prestigious annual business conference in Jerusalem ","link":"https:\/\/north.mandelfoundation.org.il\/english\/About\/News\/Pages\/Business-Conference-2018.aspx","is_inner":"yes","slug":"business-conference-2018","text":"​The Israel Business Conference, which has been held annually for two decades, is known as the most important and prestigious economic and social event in Israel. The Conference brings together representatives of the public sector, non-profit organizations, and the business sector, researchers in the fields of economy and society, leading media figures, and speakers and delegations from Israel and around the world for direct interaction with each other. \nThe Conference explored a range of fields relevant to business and economic development.  It offered Mandel fellows a unique opportunity to get involved and see how things operate on the ground, to connect with potential stakeholders, and to gain experience in creating opportunities, advancing enterprises in fields that are relevant to them, and recruiting partners.\nThe fellows attended lectures and panel discussions on social issues and on promoting initiatives that connect Israel’s periphery with its center. In between the sessions and activities, the fellows met with the CEO of Bank Hapoalim, Arik Pinto, for a discussion. Mr. Pinto agreed to visit the Mandel Program for Social Leadership at the Mandel Center for Leadership in the North, in order to learn and discuss issues of interest to the fellows.\n\n","html_content":"<p>​The Israel Business Conference, which has been held annually for two decades, is known as the most important and prestigious economic and social event in Israel. The Conference brings together representatives of the public sector, non-profit organizations, and the business sector, researchers in the fields of economy and society, leading media figures, and speakers and delegations from Israel and around the world for direct interaction with each other.&nbsp;<\/p>\n<p>The Conference explored a range of fields relevant to business and economic development.&nbsp; It offered Mandel fellows a unique opportunity to get involved and see how things operate on the ground, to connect with potential stakeholders, and to gain experience in creating opportunities, advancing enterprises in fields that are relevant to them, and recruiting partners.<\/p>\n<p>The fellows attended lectures and panel discussions on social issues and on promoting initiatives that connect Israel’s periphery with its center. In between the sessions and activities, the fellows met with the CEO of Bank Hapoalim, \n   <strong>Arik Pinto<\/strong>, for a discussion. Mr. Pinto agreed to visit the Mandel Program for Social Leadership at the Mandel Center for Leadership in the North, in order to learn and discuss issues of interest to the fellows.<br><br><\/p>\n<p>\n   <img src=\"\/english\/SiteCollectionImages\/News\/North-business-conference.jpg\" alt=\"Mandel Social Leadership Fellows Attend Israel Business Conference\" class=\"img-responsive\">\n   <br>\n<\/p>\n<p>\n   <br>\n<\/p>\n","images":{"north-business-conference.jpg":{"src":"https:\/\/north.mandelfoundation.org.il\/english\/SiteCollectionImages\/News\/North-business-conference.jpg","caption":""}},"attachments":[],"outer_links":[]},"north-graduation-2018":{"title":"Mandel Leadership Programs in the North Celebrate Graduation","date":"2018-11-21","image":"https:\/\/north.mandelfoundation.org.il\/english\/SiteCollectionImages\/News\/graduation-2018s.jpg","excerpt":"Fellows of the Mandel Program for Social Leadership and the Mandel Program for Regional Leadership in the North celebrated at a joint ceremony ","link":"https:\/\/north.mandelfoundation.org.il\/english\/About\/News\/Pages\/North-graduation-2018.aspx","is_inner":"yes","slug":"north-graduation-2018","text":"​At a celebratory event attended by Mr. Moshe Vigdor, director general of the Mandel Foundation–Israel, the fellows of Cohort 1 of the Mandel Program for Social Leadership and Cohort 2 of the Mandel Program for Regional Leadership in the North received graduation certificates. Celebrating with the new graduates were the current fellows of both programs and the staff and faculty of the Mandel Center for Leadership in the North.\n“I have no doubt that the tools you received from the dedicated professional staff at the Mandel Center for Leadership in the North will help you on the journeys on which you are now embarking,” said Moshe Vigdor, director general of the Mandel Foundation–Israel. “As Morton Mandel likes to say: ‘Don’t say thank you. You are doing the work, changing the world, and making it a better place, so you are actually doing my work for me.’”\nThe event included a performance called “Bereishit” (“Genesis”) by an ensemble of Jewish and Arab youth from Beresheet LaShalom, a nonprofit organization that promotes tolerance and coexistence through stage arts.\nIn addition to a graduation certificate, each graduate received a work of art by illustrator Aya Orbach that was based on the personal project that he or she began developing during the program and will now implement in the field. Examples of these projects include a proposal for changing the bagrut matriculation exams in a manner that will promote a more meaningful learning experience; a program to develop life skills in the Arab sector by means of experiential learning; and more.\n“I would like to express our heartfelt thanks for the opportunity we had to meet the special people we met here,\" said Yael Ben Moyal, who spoke during the ceremony on behalf of the new graduates. \"We are thankful for the important and fascinating areas of study we were able to explore. Thank you as well to the dear members of staff, who worked to provide the most conducive and pleasant conditions for growth, and did so with great warmth and belief in us.” \nThe Mandel Program for Social Leadership is a full-time, one-year study program that provides full scholarships and living stipends to participants. The Mandel Program for Regional Leadership in the North meets one day a week, with a total of 40 study days over the course of one year.\n","html_content":"<p>​At a celebratory event attended by \n   <strong>Mr. Moshe Vigdor<\/strong>, director general of the Mandel Foundation–Israel, the fellows of Cohort 1 of the Mandel Program for Social Leadership and Cohort 2 of the Mandel Program for Regional Leadership in the North received graduation certificates. Celebrating with the new graduates were the current fellows of both programs and the staff and faculty of the Mandel Center for Leadership in the North.<br><br><\/p>\n<p>\n   <br>“I have no doubt that the tools you received from the dedicated professional staff at the Mandel Center for Leadership in the North will help you on the journeys on which you are now embarking,” said \n   <strong>Moshe Vigdor<\/strong>, director general of the Mandel Foundation–Israel. “As \n   <strong>Morton Mandel<\/strong> likes to say: ‘Don’t say thank you. You are doing the work, changing the world, and making it a better place, so you are actually doing my work for me.’”<br><\/p>\n<p>The event included a performance called “Bereishit” (“Genesis”) by an ensemble of Jewish and Arab youth from Beresheet LaShalom, a nonprofit organization that promotes tolerance and coexistence through stage arts.<\/p>\n<p>In addition to a graduation certificate, each graduate received a work of art by illustrator Aya Orbach that was based on the personal project that he or she began developing during the program and will now implement in the field. Examples of these projects include a proposal for changing the bagrut matriculation exams in a manner that will promote a more meaningful learning experience; a program to develop life skills in the Arab sector by means of experiential learning; and more.<\/p>\n<p>“I would like to express our heartfelt thanks for the opportunity we had to meet the special people we met here,\" said \n   <strong>Yael Ben Moyal<\/strong>, who spoke during the ceremony on behalf of the new graduates. \"We are thankful for the important and fascinating areas of study we were able to explore. Thank you as well to the dear members of staff, who worked to provide the most conducive and pleasant conditions for growth, and did so with great warmth and belief in us.”&nbsp;<\/p>\n<p>The Mandel Program for Social Leadership is a full-time, one-year study program that provides full scholarships and living stipends to participants. The Mandel Program for Regional Leadership in the North meets one day a week, with a total of 40 study days over the course of one year.<br><br><\/p>\n","images":[],"attachments":[],"outer_links":[]},"mcn_register_2017s":{"title":"Registration Opens for Cohort 2 of Regional Leadership Program","date":"2017-05-15","image":"https:\/\/north.mandelfoundation.org.il\/english\/SiteCollectionImages\/News\/mcn_register_2017s.jpg","excerpt":"The program aims to train visionary leaders who will lead change and create a better and more worthy society in Israel's Northern region ","link":"https:\/\/north.mandelfoundation.org.il\/english\/Programs\/Pages\/Mandel-Program-for-Regional-Leadership-in-the-North.aspx","is_inner":"no","slug":"mcn_register_2017s"},"regional-cohort-3-begins":{"title":"Cohort 3 of Regional Leadership Program Begins Studies","date":"2018-10-10","image":"https:\/\/north.mandelfoundation.org.il\/english\/SiteCollectionImages\/News\/Opening-meeting-2019_s.JPG","excerpt":"The launch of the academic year included a musical introductory workshop, an inspirational lecture from a social entrepreneur, and an orientation ","link":"https:\/\/north.mandelfoundation.org.il\/english\/About\/News\/Pages\/Regional-cohort-3-begins.aspx","is_inner":"yes","slug":"regional-cohort-3-begins","text":"​Cohort 3 of the Mandel Program for Regional Leadership in the North, directed by Safa Garb, began its studies at the Mandel Center for Leadership in the North on October 10, 2018. Comprised of men and women from Jewish and Arab communities in the North who were carefully selected to participate in this unique program, the new cohort will be meeting every Thursday over the course of the academic year. The program enables fellows to study together and to develop social enterprises that aim to improve Israeli society, with a focus on the north of the country.\nThe festive launch of the program included a musical introductory workshop, with the participation of the faculty of the Mandel Center for Leadership in the North, in which the participants were able to express themselves in a creative manner. This was followed by an inspirational lecture from social entrepreneur Yuval Roth, the founder of the nonprofit “On the Road to Recovery” and one of the winners of the “CNN Heroes” competition. \nThe day concluded with an orientation session in which expectations were set and the program’s unique learning processes were explained.\n","html_content":"<p>​Cohort 3 of the Mandel Program for Regional Leadership in the North, directed by Safa Garb, began its studies at the Mandel Center for Leadership in the North on October 10, 2018. Comprised of men and women from Jewish and Arab communities in the North who were carefully selected to participate in this unique program, the new cohort will be meeting every Thursday over the course of the academic year. The program enables fellows to study together and to develop social enterprises that aim to improve Israeli society, with a focus on the north of the country.<\/p>\n<p>The festive launch of the program included a musical introductory workshop, with the participation of the faculty of the Mandel Center for Leadership in the North, in which the participants were able to express themselves in a creative manner. This was followed by an inspirational lecture from social entrepreneur \n   <strong>Yuval Roth<\/strong>, the founder of the nonprofit “On the Road to Recovery” and one of the winners of the “CNN Heroes” competition.&nbsp;<\/p>\n<p>The day concluded with an orientation session in which expectations were set and the program’s unique learning processes were explained.<br><br><\/p>\n<p>\n   <img src=\"\/english\/SiteCollectionImages\/News\/Opening-meeting-2019.JPG\" alt=\"Cohort 3 of the Mandel Program for Regional Leadership in the North Begins Studies\" class=\"img-responsive\">\n   <br>\n<\/p>\n","images":{"opening-meeting-2019.jpg":{"src":"https:\/\/north.mandelfoundation.org.il\/english\/SiteCollectionImages\/News\/Opening-meeting-2019.JPG","caption":""}},"attachments":[],"outer_links":[]},"nation-state-evening-2018":{"title":"Panel on the Nation-State Law","date":"2018-04-04","image":"https:\/\/north.mandelfoundation.org.il\/english\/SiteCollectionImages\/News\/Nation-state-1_s.JPG","excerpt":"The Mandel Center for Leadership in the North hosted a panel  including Adv. Moshe Lador, Dr. Yoaz Hendel, and Brigadier General Amal Assad ","link":"https:\/\/north.mandelfoundation.org.il\/english\/About\/News\/Pages\/Nation-state-evening-2018.aspx","is_inner":"yes","slug":"nation-state-evening-2018","text":"​The Nation-State Law has been a highly controversial issue that has gripped Israeli society. On October 4, 2018, a study event on this topic was held at the Mandel Center for Leadership in the North, organized and led by graduates of the Center’s programs.\nThe main part of the evening was devoted to a discussion by a panel made up of experts and figures with a particular interest in the passage of this piece of legislation.  The panelists included former state prosecutor Adv. Moshe Lador, Dr. Yoaz Hendel, and Brigadier General Amal Assad. The discussion of the Nation-State Law was moderated by Arad Erez, a graduate of Cohort 2 of the Mandel Program for Regional Leadership in the North. \nFollowing the presentations by the panelists, there was an open discussion between the members of the panel and the audience, which included fellows,  graduates, and faculty members of the Mandel Program for Social Leadership and the Mandel Program for Regional Leadership in the North.\n","html_content":"<p>​The Nation-State Law has been a highly controversial issue that has gripped Israeli society. On October 4, 2018, a study event on this topic was held at the Mandel Center for Leadership in the North, organized and led by graduates of the Center’s programs.<\/p>\n<p>The main part of the evening was devoted to a discussion by a panel made up of experts and figures with a particular interest in the passage of this piece of legislation.&nbsp; The panelists included former state prosecutor \n   <strong>Adv. Moshe Lador<\/strong>, \n   <strong>Dr. Yoaz Hendel<\/strong>, and \n   <strong>Brigadier General Amal Assad<\/strong>. The discussion of the Nation-State Law was moderated by \n   <strong>Arad Erez<\/strong>, a graduate of Cohort 2 of the Mandel Program for Regional Leadership in the North.&nbsp;<\/p>\n<p>Following the presentations by the panelists, there was an open discussion between the members of the panel and the audience, which included fellows,&nbsp; graduates, and faculty members of the Mandel Program for Social Leadership and the Mandel Program for Regional Leadership in the North.<br><br><\/p>\n<p>\n   <img src=\"\/english\/SiteCollectionImages\/News\/Nation-state.JPG\" alt=\"Panel on the Nation-State Law\" class=\"img-responsive\">\n   <br>\n<\/p>\n","images":{"nation-state.jpg":{"src":"https:\/\/north.mandelfoundation.org.il\/english\/SiteCollectionImages\/News\/Nation-state.JPG","caption":""}},"attachments":[],"outer_links":[]},"graduation-regional1":{"title":"Graduation of Cohort 1 of the Regional Leadership Program","date":"2018-03-20","image":"https:\/\/north.mandelfoundation.org.il\/english\/SiteCollectionImages\/News\/graduation-regional-2018s.jpg","excerpt":"At the center of the ceremony was the screening of short videos about the individual projects developed by the fellows during the program ","link":"https:\/\/north.mandelfoundation.org.il\/english\/About\/News\/Pages\/graduation-regional1.aspx","is_inner":"yes","slug":"graduation-regional1","text":"​Cohort 1 of the Mandel Program for Regional Leadership in the North marked their graduation in a festive ceremony on March 20, 2018. The highlight of the ceremony was the screening of animated video clips that present the individual projects that the fellows developed as part of the program, and which they will continue to develop and implement now that they have graduated.\nAmong the projects that were presented were an initiative to establish a center for sustainability and environmental education in Shfaram; a project that will promote and expand the non-profit organization “Spit4Life,” which is dedicated to increasing awareness of bone marrow stem cell transplantation for cancer patients and to expanding Israel's bone marrow registry; a project that will establish an incubator for social initiatives in the North; an initiative dedicated to promoting higher education among Bedouin women; and more.\nMr. Moshe Vigdor, the director general of the Mandel Foundation–Israel, congratulated the new graduates and wished them luck with their endeavors. The staff members of the Mandel Center for Leadership in the North join him in extending best wishes to the graduates for success in the future.\nView the animated videos of the individual projects (Hebrew) >>\n","html_content":"<p>​Cohort 1 of the Mandel Program for Regional Leadership in the North marked their graduation in a festive ceremony on March 20, 2018. The highlight of the ceremony was the screening of animated video clips that present the individual projects that the fellows developed as part of the program, and which they will continue to develop and implement now that they have graduated.<\/p>\n<p>Among the projects that were presented were an initiative to establish a center for sustainability and environmental education in Shfaram; a project that will promote and expand the non-profit organization “Spit4Life,” which is dedicated to increasing awareness of bone marrow stem cell transplantation for cancer patients and to expanding Israel's bone marrow registry; a project that will establish an incubator for social initiatives in the North; an initiative dedicated to promoting higher education among Bedouin women; and more.<\/p>\n<p>\n   <strong>Mr. Moshe Vigdor<\/strong>, the director general of the Mandel Foundation–Israel, congratulated the new graduates and wished them luck with their endeavors. The staff members of the Mandel Center for Leadership in the North join him in extending best wishes to the graduates for success in the future.<\/p>\n<p><a href=\"https:\/\/north.mandelfoundation.org.il\/Fellows\/Projects\/RegionalLeadership1\/index.aspx\" title=\"View the animated videos of the individual projects (Hebrew)\" target=\"_blank\">View the animated videos of&nbsp;the individual projects (Hebrew) &gt;&gt;<\/a><br><br><\/p>\n<p>\n   <img src=\"\/english\/SiteCollectionImages\/News\/graduation-regional-2018.jpg\" alt=\"Graduation of Cohort 1 of the Regional Leadership Program\" class=\"img-responsive\">\n   <br>\n<\/p>\n","images":{"graduation-regional-2018.jpg":{"src":"https:\/\/north.mandelfoundation.org.il\/english\/SiteCollectionImages\/News\/graduation-regional-2018.jpg","caption":""}},"attachments":[],"outer_links":[{"title":"View the animated videos of the individual projects (Hebrew) >>","url":"https:\/\/north.mandelfoundation.org.il\/Fellows\/Projects\/RegionalLeadership1\/index.aspx"}]},"social-hackathon-2018":{"title":"Social Hackathon on Inclusion in Informal Education","date":"2018-02-20","image":"https:\/\/north.mandelfoundation.org.il\/english\/SiteCollectionImages\/News\/social-hackathon-2018s.jpg","excerpt":"Led by fellows of Cohort 2 of the regional leadership program, the event examined the inclusion of people with disabilities in informal education ","link":"https:\/\/north.mandelfoundation.org.il\/english\/About\/News\/Pages\/social-hackathon-2018.aspx","is_inner":"yes","slug":"social-hackathon-2018","text":"​Israeli society, like many other places in the world, has a long history of social marginalization. Most of us tend to seek the company of people who are similar to us, and shun those who are different. However, a healthy society is one that values the differences of its members, and knows how to make the most of them.\nThe Social Hackathon hosted by the Mandel Center for Leadership in the North was open to the general public, and was attended by fellows of the program and external guests. During the course of the day, participants explored the question of whether informal education in its current state meets the needs of people with disabilities. Similarly, it examined how informal education settings might be encouraged to promote inclusion and acceptance of diversity in Israeli society.\nThe participants also enjoyed an uplifting performance by Bayit Baemek, a group of young adults from a \"home in the community\" – a residential project for people with cognitive disabilities. Members of the troupe performed some well-known songs and poems, alongside some original material. Their performance, which moved everyone in the audience to the core, demonstrated the extent to which “inclusion” is about more than just giving to others, and how much society stands to gain from promoting inclusion and fostering acceptance. The discussions at the hackathon gave rise to the idea of creating a \"certification mark\" that will attest to compliance with standards for social inclusion. Several fellows have already begun to work on this project.\n\n","html_content":"<p>​Israeli society, like many other places in the world, has a long history of social marginalization. Most of us tend to seek the company of people who are similar to us, and shun those who are different. However, a healthy society is one that values the differences of its members, and knows how to make the most of them.<\/p>\n<p>The Social Hackathon hosted by the Mandel Center for Leadership in the North was open to the general public, and was attended by fellows of the program and external guests. During the course of the day, participants explored the question of whether informal education in its current state meets the needs of people with disabilities. Similarly, it examined how informal education settings might be encouraged to promote inclusion and acceptance of diversity in Israeli society.<\/p>\n<p>The participants also enjoyed an uplifting performance by Bayit Baemek, a group of young adults from a \"home in the community\" – a residential project for people with cognitive disabilities. Members of the troupe performed some well-known songs and poems, alongside some original material. Their performance, which moved everyone in the audience to the core, demonstrated the extent to which “inclusion” is about more than just giving to others, and how much society stands to gain from promoting inclusion and fostering acceptance. The discussions at the hackathon gave rise to the idea of creating a \"certification mark\" that will attest to compliance with standards for social inclusion. Several fellows have already begun to work on this project.<br><\/p>\n<p><br><\/p>\n<p>\n   <img src=\"\/english\/SiteCollectionImages\/News\/social-hackathon-2018.jpg\" alt=\"Social Hackathon on Inclusion in Informal Education\" class=\"img-responsive\">\n   <br>\n<\/p>\n","images":{"social-hackathon-2018.jpg":{"src":"https:\/\/north.mandelfoundation.org.il\/english\/SiteCollectionImages\/News\/social-hackathon-2018.jpg","caption":""}},"attachments":[],"outer_links":[]},"hiriya-2017":{"title":"Tour of Hiriya and the Ariel Sharon Park","date":"2017-11-21","image":"https:\/\/north.mandelfoundation.org.il\/english\/SiteCollectionImages\/News\/Hiriya-s.jpg","excerpt":"Fellows discussed sustainability and vision with Dr. Martin Weyl, a leader of the struggle to establish the urban park and recycling center ","link":"https:\/\/north.mandelfoundation.org.il\/english\/About\/News\/Pages\/Hiriya-2017.aspx","is_inner":"yes","slug":"hiriya-2017","text":"​In his introduction to Martin Weyl’s book Hiriya: On Stench and Beauty – The Greening of Israel's Largest Garbage Dump, Haim Guri wrote that during his visit to the site he was reminded “…of the alchemists who sought to transform base metal into gold. Here at the ‘Hiriya Dump,’ which is being transformed into a national park and a first-rate recycling operation before our very eyes, we saw how refuse and waste are made into life-giving products that conserve and protect our environment, and are creating a landscape of beauty for Israelis and tourists.” \nOn November 21, some 30 fellows from the Mandel Center for Leadership in the North's social leadership program and regional leadership program participated in a tour of the Hiriya refuse site and of the Ariel Sharon Park. The tour began with an introduction to refuse and recycling issues in Israel and around the world, and continued with a discussion of broader questions of society and sustainability. The group was then given a guided tour of the park, including a transfer station where waste from 24 local authorities in central Israel is gathered, a Refuse Derived Fuel (RDF) plant that transforms waste into solid fuel for Israel's cement industry, and Hiriya – formerly a \"garbage mountain,\" and now a green and blooming park.\nThe high point of the visit was a conversation with Dr. Martin Weyl, the visionary and the driving force behind Ariel Sharon Park, who spearheaded the transformation of a refuse site into a recycling and sustainability education center. Dr. Weyl encouraged the Mandel fellows to dream, and urged them not to be deterred by the difficulties and obstacles that face all those who seek to venture – and lead – beyond the pale of routine familiarity and custom.\n\n","html_content":"<p>​In his introduction to Martin Weyl’s book Hiriya: On Stench and Beauty – The Greening of Israel's Largest Garbage Dump, Haim Guri wrote that during his visit to the site he was reminded “…of the alchemists who sought to transform base metal into gold. Here at the ‘Hiriya Dump,’ which is being transformed into a national park and a first-rate recycling operation before our very eyes, we saw how refuse and waste are made into life-giving products that conserve and protect our environment, and are creating a landscape of beauty for Israelis and tourists.”&nbsp;<\/p>\n<p>On November 21, some 30 fellows from the Mandel Center for Leadership in the North's social leadership program and regional leadership program participated in a tour of the Hiriya refuse site and of the Ariel Sharon Park. The tour began with an introduction to refuse and recycling issues in Israel and around the world, and continued with a discussion of broader questions of society and sustainability. The group was then given a guided tour of the park, including a transfer station where waste from 24 local authorities in central Israel is gathered, a Refuse Derived Fuel (RDF) plant that transforms waste into solid fuel for Israel's cement industry, and Hiriya – formerly a \"garbage mountain,\" and now a green and blooming park.<\/p>\n<p>The high point of the visit was a conversation with Dr. Martin Weyl, the visionary and the driving force behind Ariel Sharon Park, who spearheaded the transformation of a refuse site into a recycling and sustainability education center. Dr. Weyl encouraged the Mandel fellows to dream, and urged them not to be deterred by the difficulties and obstacles that face all those who seek to venture – and lead – beyond the pale of routine familiarity and custom.<br><\/p>\n<p>\n   <br>\n<\/p>\n","images":[],"attachments":[],"outer_links":[]},"mandel-leadership-program-in-afula-marks-graduation":{"title":"Mandel Leadership Program in Afula Marks Graduation","date":"2017-10-17","image":"https:\/\/north.mandelfoundation.org.il\/english\/SiteCollectionImages\/News\/Afula-Graduation-2017_S.jpg","excerpt":"The Mandel Local Leadership Program in Afula drew to a close with a festive ceremony attended by Afula Mayor Yitzhak Miron and Mr. Moshe Vigdor ","link":"https:\/\/north.mandelfoundation.org.il\/english\/About\/News\/Pages\/Mandel-Leadership-Program-in-Afula-Marks-Graduation.aspx","is_inner":"yes","slug":"mandel-leadership-program-in-afula-marks-graduation","text":"​On October 17 2017, the Mandel Center for Leadership in the North celebrated the graduation of the Mandel Local Leadership Program in Afula. The festive ceremony was attended by Afula Mayor Yitzhak Meron; Mr. Moshe Vigdor, director general of the Mandel Foundation-Israel; and Ayelet Ilani and Dalit Caspin, the co-directors of the program, as well as the program's graduates and their friends and relatives.\nDuring the program’s two years of intensive study, the fellows explored social and philosophical issues, and matters of leadership and public policy. They underwent a process of personal and professional development that contributed to their development as leaders who are equipped with the necessary tools for implementing their vision.\nMr. Moshe Vigdor, director general of the Mandel Foundation-Israel, thanked the municipality of Afula for its cooperation, congratulated the graduating fellow on their graduation, and wished the graduates a successful and productive future. Afula Mayor Yitzhak Meron expressed his confidence in the future work of the graduates, and called on them to raise the gauntlet and take up the challenge of establishing an incubator for social entrepreneurship in the city.\n","html_content":"<p>​On October 17 2017, the Mandel Center for Leadership in the North celebrated the graduation of the Mandel Local Leadership Program in Afula. The festive ceremony was attended by Afula Mayor Yitzhak Meron; Mr. Moshe Vigdor, director general of the Mandel Foundation-Israel; and Ayelet Ilani and Dalit Caspin, the co-directors of the program, as well as the program's graduates and their friends and relatives.<\/p>\n<p>During the program’s two years of intensive study, the fellows explored social and philosophical issues, and matters of leadership and public policy. They underwent a process of personal and professional development that contributed to their development as leaders who are equipped with the necessary tools for implementing their vision.<\/p>\n<p>Mr. Moshe Vigdor, director general of the Mandel Foundation-Israel, thanked the municipality of Afula for its cooperation, congratulated the graduating fellow on their graduation, and wished the graduates a successful and productive future. Afula Mayor Yitzhak Meron expressed his confidence in the future work of the graduates, and called on them to raise the gauntlet and take up the challenge of establishing an incubator for social entrepreneurship in the city.<br><br><\/p>\n<p>\n   <img src=\"\/english\/SiteCollectionImages\/News\/Afula-Graduation-2017_B.jpg\" alt=\"Mandel Leadership Program in Afula Marks Graduation\" class=\"img-responsive\">\n   <br>\n<\/p>\n","images":{"afula-graduation-2017_b.jpg":{"src":"https:\/\/north.mandelfoundation.org.il\/english\/SiteCollectionImages\/News\/Afula-Graduation-2017_B.jpg","caption":""}},"attachments":[],"outer_links":[]},"second-cohort-of-regional-leadership-program-begins-studies":{"title":"Second Cohort of Regional Program Begins Studies","date":"2017-10-17","image":"https:\/\/north.mandelfoundation.org.il\/english\/SiteCollectionImages\/News\/Regional-Cohort2-2017_S.jpg","excerpt":"A diverse group of 21 men and women, Arabs and Jews, from Israel’s north began studies at the Mandel Center for Leadership in the North ","link":"https:\/\/north.mandelfoundation.org.il\/english\/About\/News\/Pages\/Second-Cohort-of-Regional-Leadership-Program-Begins-Studies.aspx","is_inner":"yes","slug":"second-cohort-of-regional-leadership-program-begins-studies","text":"​On October 17, 2017, the second cohort of the Mandel Program for Regional Leadership in the North began its studies. The opening session was attended by 21 men and women, Arabs and Jews, from Israel’s northern region. They hail from diverse backgrounds and include social and environmental activists, business entrepreneurs, local government officials, and educators.\nThe session introduced the fellows to each other and to the program, giving them a sense of what to expect during the year to come. It also included a workshop on traditional songs in four languages – Yiddish, Hebrew, Arabic and Ladino – which was conducted by singer and musician Rakefet Amsalem. The fellows then met social entrepreneur Yuval Roth, the founder of The Road to Recovery, an NGO that operates a network of volunteers that transport Palestinian patients between Israeli government checkpoints and Israeli hospitals. \nThe Mandel Program for Regional Leadership in the North is a one-year, in-service program that comprises one day of intensive study a week, along with several intensive workshops and two to three-day study tours.\n","html_content":"<p>​On October 17, 2017, the second cohort of the Mandel Program for Regional Leadership in the North began its studies. The opening session was attended by 21 men and women, Arabs and Jews, from Israel’s northern region. They hail from diverse backgrounds and include social and environmental activists, business entrepreneurs, local government officials, and educators.<\/p>\n<p>The session introduced the fellows to each other and to the program, giving them a sense of what to expect during the year to come. It also included a workshop on traditional songs in four languages – Yiddish, Hebrew, Arabic and Ladino – which was conducted by singer and musician Rakefet Amsalem. The fellows then met social entrepreneur Yuval Roth, the founder of The Road to Recovery, an NGO that operates a network of volunteers that transport Palestinian patients between Israeli government checkpoints and Israeli hospitals.&nbsp;<\/p>\n<p>The Mandel Program for Regional Leadership in the North is a one-year, in-service program that comprises one day of intensive study a week, along with several intensive workshops and two to three-day study tours.<br><br><\/p>\n<p>\n   <img src=\"\/english\/SiteCollectionImages\/News\/Regional-Cohort2-2017_B.jpg\" alt=\"Second Cohort of Mandel Regional Leadership Program Begins Studies\" class=\"img-responsive\">\n   <br>\n<\/p>\n","images":{"regional-cohort2-2017_b.jpg":{"src":"https:\/\/north.mandelfoundation.org.il\/english\/SiteCollectionImages\/News\/Regional-Cohort2-2017_B.jpg","caption":""}},"attachments":[],"outer_links":[]},"north-social_s":{"title":"Mandel Social Leadership Program to Open in the Fall","date":"2017-02-02","image":"https:\/\/north.mandelfoundation.org.il\/english\/SiteCollectionImages\/News\/North-Social_s.jpg","excerpt":"The Mandel Program for Social Leadership in the North will train high quality leaders who will lead change in diverse areas of life ","link":"https:\/\/north.mandelfoundation.org.il\/english\/Programs\/Pages\/Mandel-Program-for-Social-Leadership-in-the-North.aspx","is_inner":"no","slug":"north-social_s"},"religious-secular-meetings-in-migdal-haemek_s":{"title":"Mandel Graduates Bridge Religious-Secular Divide","date":"2016-10-27","image":"https:\/\/north.mandelfoundation.org.il\/english\/SiteCollectionImages\/News\/Religious-Secular-Meetings-in-Migdal-Haemek_s.jpg","excerpt":"Mandel graduates Liora Pinsky and Rabbi Yair Afik have initiated a series of meetings secular and religious students in Migdal HaEmek (Hebrew) ","link":"http:\/\/www.migdal-haemeq.muni.il\/Lists\/List1\/DispForm.aspx?ID=2265","is_inner":"no","slug":"religious-secular-meetings-in-migdal-haemek_s"},"baqa_graduation_2016":{"title":"Graduation of Local Leadership Program in Baqa al-Gharbiyye","date":"2016-10-10","image":"https:\/\/north.mandelfoundation.org.il\/english\/SiteCollectionImages\/News\/graduation_Baqa_2016-s.jpg","excerpt":"The Mandel Program for Local Leadership in Baqa al-Gharbiyye concluded with a celebratory ceremony attended by the head of the local council ","link":"https:\/\/north.mandelfoundation.org.il\/english\/About\/News\/Pages\/Baqa_graduation_2016.aspx","is_inner":"yes","slug":"baqa_graduation_2016","text":"​On October 10, 2016, a celebratory graduation ceremony was held for the fellows of the Mandel Program for Local Leadership in Baqa al-Gharbiyye, in the presence of their friends and relatives, the program directors, the head of the local council, and Moshe Vigdor, the director general of the Mandel Foundation–Israel. Over the course of two intensive years of study, the fellows acquired new knowledge and experiences, and underwent a process of personal and professional development that has prepared them to serve as effective, moral, and visionary leaders. \n“Today marks not the end of your leadership studies, but the transition to a new stage, in which you have become graduates and leaders with effective tools for social action,” said Dr. Asaf Turgeman, the co-director of the program, who served as master of ceremonies.\nThe head of the Baqa al-Gharbiyye local council, Mr. Morsi Abu Moch, spoke about the high expectations that the graduates will realize their plans for improving the town. Mr. Moshe Vigdor, the director general of the Mandel Foundation–Israel, thanked the local council for its cooperation, congratulated the fellows, and wished them every success in their efforts. \nSpeaking on behalf of the fellows, Ms. Marwa Watad and Mr. Tyseer Atamnah described the personal and collective experience that they underwent as participants in the program, and expressed their desire to continue to meet and engage in meaningful activity together in the future. Shahira Shalaby, the co-director of the program, spoke about the town of Baqa and about the great respect and sincere appreciation that the members of the group share for one another.\nDr. Asaf Turgeman concluded the ceremony by quoting the philosopher Baruch Spinoza: “And now, even if the way toward our goal seems very difficult, it can still be found. For anything that is truly precious is difficult to come by; if happiness were the lot of every person, and there was no need for striving or hard work, how would anyone ever be unhappy? Indeed, every worthy thing is hard to reach, difficult, and precious.”\n","html_content":"<p>​On October 10, 2016, a celebratory graduation ceremony was held for the fellows of the Mandel Program for Local Leadership in Baqa al-Gharbiyye, in the presence of their friends and relatives, the program directors, the head of the local council, and Moshe Vigdor, the director general of the Mandel Foundation–Israel. Over the course of two intensive years of study, the fellows acquired new knowledge and experiences, and underwent a process of personal and professional development that has prepared them to serve as effective, moral, and visionary leaders.&nbsp;<\/p>\n<p>“Today marks not the end of your leadership studies, but the transition to a new stage, in which you have become graduates and leaders with effective tools for social action,” said Dr. Asaf Turgeman, the co-director of the program, who served as master of ceremonies.<\/p>\n<p>The head of the Baqa al-Gharbiyye local council, Mr. Morsi Abu Moch, spoke about the high expectations that the graduates will realize their plans for improving the town. Mr. Moshe Vigdor, the director general of the Mandel Foundation–Israel, thanked the local council for its cooperation, congratulated the fellows, and wished them every success in their efforts.&nbsp;<\/p>\n<p>Speaking on behalf of the fellows, Ms. Marwa Watad and Mr. Tyseer Atamnah described the personal and collective experience that they underwent as participants in the program, and expressed their desire to continue to meet and engage in meaningful activity together in the future. Shahira Shalaby, the co-director of the program, spoke about the town of Baqa and about the great respect and sincere appreciation that the members of the group share for one another.<\/p>\n<p>Dr. Asaf Turgeman concluded the ceremony by quoting the philosopher Baruch Spinoza: “And now, even if the way toward our goal seems very difficult, it can still be found. For anything that is truly precious is difficult to come by; if happiness were the lot of every person, and there was no need for striving or hard work, how would anyone ever be unhappy? Indeed, every worthy thing is hard to reach, difficult, and precious.”<br><\/p>\n","images":[],"attachments":[],"outer_links":[]},"summing-up-the-first-year-of-the-afula-leadership-program":{"title":"Summing Up the First Year of the Afula Leadership Program","date":"2016-07-10","image":"https:\/\/north.mandelfoundation.org.il\/english\/SiteCollectionImages\/News\/afula-finish-1-year_Small.jpg","excerpt":"The directors of the Mandel Program for Local Leadership in Afula sum up the program's first academic year and look toward the future ","link":"https:\/\/north.mandelfoundation.org.il\/english\/About\/News\/Pages\/Summing-Up-the-First-Year-of-the-Afula-Leadership-Program.aspx","is_inner":"yes","slug":"summing-up-the-first-year-of-the-afula-leadership-program","text":"​The first year of the Mandel Program for Local Leadership in Afula is coming to an end, as the fellows submit their final projects and meet individually with the program directors. This was a year of intensive study through many methods and various perspectives.\nThe program worked toward four goals this year:\nThe first goal was to create relationships and partnerships between the various groups of residents in Afula, by means of fruitful dialogue and building a common language among the fellows to influence the nature of public discourse in the city. The goal was for the discourse to focus on common interests of the residents while acknowledging their different visions for Afula's future and for improving the quality of life in the city. We worked toward this goal in two principal ways:\nOur second goal was to improve the fellows' working methods and their ability to influence their environment. The program emphasized examination of the work methods of the fellows. The fellows investigated their work methods in practice by clarifying their values, defining their vision, and engaging in theoretical conceptualization of their work in reality. For this purpose, the entire team was mobilized to develop a model of \"work analysis,\" under the guidance of Yafa Benaya, an outside consultant. A series of 12 meetings took place in four small groups, which were facilitated by four staff members who guided the fellows in investigating their activity in their workplaces. The fellows valued this part of the program very much. Each fellow received an opportunity to present key dilemmas in his or her professional and public environment and analyze them together with the facilitator and the group from a theoretical perspective, in an intimate, respectful atmosphere.\nThe third goal selected, based on preparatory research done for us by Dr. Meirav Aharon Gutman of the Technion, concerned the environment, at a time when Afula is undergoing an accelerated process of construction and physical growth. We studied and examined the options for optimal development of the rapidly changing urban space. According to Afula's master plan, the city's population is expected to reach approximately 130,000 residents by 2025. Together, using various tools, we investigated the range of options for developing a \"suitable city\" in terms of its physical, human, and communal make up. We devoted a series of meetings to in-depth study of the city: its history, processes of development, absorption of waves of immigration and the effect of the immigrants on the city, the meaning of its moniker \"the capital of the Jezreel Valley\" and its challenges. We discussed the values that define the suitable city, as well as various urban models for \"good urbanism,\" with their benefits and drawbacks. We learned about attempts by Israel and other countries to rebrand their cities, revive downtown areas, promote varied uses of the city, and engage in social urban planning that takes into account the variety of traffic in the public space as well as the needs of the various communities and groups that live there.\nThe fourth and final goal, which will accompany us into the second academic year of the program, is the city's relationship with its environment and the potential of regional development and cooperation between Afula and its neighbors.\n","html_content":"<p style=\"text-align:justify;\">​The first year of the Mandel Program for Local Leadership in Afula is coming to an end, as the fellows submit their final projects and meet individually with the program directors. This was a year of intensive study through many methods and various perspectives. <\/p>\n<p>The program worked toward four goals this year:<\/p>\n<p style=\"text-align:justify;\"><strong>The first goal<\/strong> was to create relationships and partnerships between the various groups of residents in Afula, by means of fruitful dialogue and building a common language among the fellows to influence the nature of public discourse in the city. The goal was for the discourse to focus on common interests of the residents while acknowledging their different visions for Afula's future and for improving the quality of life in the city. We worked toward this goal in two principal ways:<\/p>\n<p style=\"text-align:justify;\"><strong>Our second goal<\/strong> was to improve the fellows' working methods and their ability to influence their environment. The program emphasized examination of the work methods of the fellows. The fellows investigated their work methods in practice by clarifying their values, defining their vision, and engaging in theoretical conceptualization of their work in reality. For this purpose, the entire team was mobilized to develop a model of \"work analysis,\" under the guidance of Yafa Benaya, an outside consultant. A series of 12 meetings took place in four small groups, which were facilitated by four staff members who guided the fellows in investigating their activity in their workplaces. The fellows valued this part of the program very much. Each fellow received an opportunity to present key dilemmas in his or her professional and public environment and analyze them together with the facilitator and the group from a theoretical perspective, in an intimate, respectful atmosphere.<\/p>\n<p style=\"text-align:justify;\"><strong>The third goal<\/strong><strong> <\/strong>selected, based on preparatory research done for us by Dr. Meirav Aharon Gutman of the Technion, concerned the environment, at a time when Afula is undergoing an accelerated process of construction and physical growth. We studied and examined the options for optimal development of the rapidly changing urban space. According to Afula's master plan, the city's population is expected to reach approximately 130,000 residents by 2025. Together, using various tools, we investigated the range of options for developing a \"suitable city\" in terms of its physical, human, and communal make up. We devoted a series of meetings to in-depth study of the city: its history, processes of development, absorption of waves of immigration and the effect of the immigrants on the city, the meaning of its moniker \"the capital of the Jezreel Valley\" and its challenges. We discussed the values that define the suitable city, as well as various urban models for \"good urbanism,\" with their benefits and drawbacks. We learned about attempts by Israel and other countries to rebrand their cities, revive downtown areas, promote varied uses of the city, and engage in social urban planning that takes into account the variety of traffic in the public space as well as the needs of the various communities and groups that live there.<\/p>\n<p style=\"text-align:justify;\"><strong>The fourth and final goal<\/strong>, which will accompany us into the second academic year of the program, is the city's relationship with its environment and the potential of regional development and cooperation between Afula and its neighbors.<\/p>\n","images":[],"attachments":[],"outer_links":[]},"morton-mandel-visits-the-mandel-center-for-leadership-in-the-north":{"title":"Morton Mandel Visits the Mandel Center in the North","date":"2016-07-01","image":"https:\/\/north.mandelfoundation.org.il\/english\/SiteCollectionImages\/News\/Mandel_north_june2016_Small.jpg","excerpt":"Mandel Foundation Chairman visited the Mandel Center for Leadership in the North, and received the “Yakir Oranim” Award from Oranim College ","link":"https:\/\/north.mandelfoundation.org.il\/english\/About\/News\/Pages\/Morton-Mandel-Visits-the-Mandel-Center-for-Leadership-in-the-North.aspx","is_inner":"yes","slug":"morton-mandel-visits-the-mandel-center-for-leadership-in-the-north","text":"​​Mr. Morton Mandel, chairman of the Mandel Foundation, visited the Mandel Center for Leadership in the North at Yokneam as part of his trip to Israel in early June. During his visit, Mr. Mandel met with fellows of the Mandel Program for Local Leadership in Baqa al-Gharbiyye. The fellows had an opportunity to speak with Mr. Mandel, ask him questions, and hear his views on leadership, personal and professional development, and philanthropy.\nWhen the meeting was over, Mr. Mandel continued on to Oranim Academic College, where he received the Yakir Oranim Award, which recognized him as a distinguished colleague of the college, at a ceremony there.\n","html_content":"<p>​​Mr. Morton Mandel, chairman of the Mandel Foundation, visited the Mandel Center for Leadership in the North at Yokneam as part of his trip to Israel in early June. During his visit, Mr. Mandel met with fellows of the Mandel Program for Local Leadership in Baqa al-Gharbiyye. The fellows had an opportunity to speak with Mr. Mandel, ask him questions, and hear his views on leadership, personal and professional development, and philanthropy.<\/p>\n<p>When the meeting was over, Mr. Mandel continued on to Oranim Academic College, where he received the Yakir Oranim Award, which recognized him as a distinguished colleague of the college, at a ceremony there.<\/p>\n","images":[],"attachments":[],"outer_links":[]},"an-interfaith-iftar-meal-in-baqa-al-gharbiyye":{"title":"An Interfaith Iftar Meal in Baqa al-Gharbiyye","date":"2016-06-22","image":"https:\/\/north.mandelfoundation.org.il\/english\/SiteCollectionImages\/News\/iftar_june2016_Small.jpg","excerpt":"An interfaith Iftar meal proved a festive opportunity to meet with fellows and graduates of the Mandel Center for Leadership in the North ","link":"https:\/\/north.mandelfoundation.org.il\/english\/About\/News\/Pages\/An-Interfaith-Iftar-Meal-in-Baqa-al-Gharbiyye.aspx","is_inner":"yes","slug":"an-interfaith-iftar-meal-in-baqa-al-gharbiyye","text":"In late June, fellows and graduates of the Mandel Center for Leadership in the North gathered at the Abu Jameel Ranch in Baqa al-Gharbiyye for an Iftar meal, the evening meal that breaks the daily Ramadan fast. Thirty fellows and graduates attended, including representatives from the Mandel Programs for Local Leadership in Kafr Qara, Tira, Afula, Migdal HaEmek, and almost the entire group of fellows from Baqa al-Gharbiyye.\nOrganized by the fellows of the Baqa al-Gharbiyye program, the evening was facilitated by program directors Shahira Shalaby and Dr. Asaf Turgeman. It was an opportunity for the fellows and graduates from Afula and Migdal HaEmek to participate in Ramadan events in Baqa al-Gharbiyye alongside graduates and fellows from the Mandel programs in Tira, Kafr Qara, and Baqa, and to become acquainted with a beautiful place – a real gem – in the city.\nThe fascinating remarks by Dr. Turgeman about the prayer to the Compassionate and Merciful God in Islam and in Judaism, the blessings and explanation about Ramadan by the Baqa fellows, the remarks of Dr. Danielle Shani, and the connections that were made between people working in and interested in the same fields, who sat down to talk or exchanged telephone numbers – these are all a further step toward building a connected and active community for improving life in the region.\n","html_content":"<p style=\"text-align:justify;\">In late June, fellows and graduates of the Mandel Center for Leadership in the North gathered at the Abu Jameel Ranch in Baqa al-Gharbiyye for an Iftar meal, the evening meal that breaks the daily Ramadan fast. Thirty fellows and graduates attended, including representatives from the Mandel Programs for Local Leadership in Kafr Qara, Tira, Afula, Migdal HaEmek, and almost the entire group of fellows from Baqa al-Gharbiyye.<\/p>\n<p style=\"text-align:justify;\">Organized by the fellows of the Baqa al-Gharbiyye program, the evening was facilitated by program directors Shahira Shalaby and Dr. Asaf Turgeman. It was an opportunity for the fellows and graduates from Afula and Migdal HaEmek to participate in Ramadan events in Baqa al-Gharbiyye alongside graduates and fellows from the Mandel programs in Tira, Kafr Qara, and Baqa, and to become acquainted with a beautiful place – a real gem – in the city.<\/p>\n<p style=\"text-align:justify;\">The fascinating remarks by Dr. Turgeman about the prayer to the Compassionate and Merciful God in Islam and in Judaism, the blessings and explanation about Ramadan by the Baqa fellows, the remarks of Dr. Danielle Shani, and the connections that were made between people working in and interested in the same fields, who sat down to talk or exchanged telephone numbers – these are all a further step toward building a connected and active community for improving life in the region.<\/p>\n","images":[],"attachments":[],"outer_links":[]},"the-concluding-retreat-of-the-mandel-program-for-local-leadership-in-baqa-al-gharbiyye":{"title":"The Concluding Retreat of the Mandel Program in Baqa","date":"2016-05-30","image":"https:\/\/north.mandelfoundation.org.il\/english\/SiteCollectionImages\/News\/MCN-generic%20-%20S.jpg","excerpt":"New graduates of the Mandel local leadership program in Baqa al-Gharbiyye share experiences and discuss their future leadership challenges  ","link":"https:\/\/north.mandelfoundation.org.il\/english\/About\/News\/Pages\/The-Concluding-Retreat-of-the-Mandel-Program-for-Local-Leadership-in-Baqa-al-Gharbiyye.aspx","is_inner":"yes","slug":"the-concluding-retreat-of-the-mandel-program-for-local-leadership-in-baqa-al-gharbiyye","text":"As part of the concluding events of the Mandel Program for Local Leadership in Baqa al-Gharbiyye, in late May, the group went on a retreat at the Beit Daniel cultural center in Zichron Yaakov.\nThe main purpose of the retreat was to give the fellows a space to share their experiences of the program with one another, discuss important points that they had experienced during the past two years, talk about missed opportunities for themselves or the group, and discuss the future leadership challenges that awaited them in their work. The retreat summed up the learning experiences through various stations: intellectual study, personal study, personal development, interpersonal feedback, the transition from fellows to graduates, and a general summary with Dr. Danielle Shani, the director of the Mandel Center for Leadership in the North.\nIn general, it emerged that the program was very meaningful for the fellows. All of them favorably acknowledged the development they had undergone, as well as the relationships and work experiences they had in the group. Shahira Shalaby and Dr. Asaf Turgeman, the program directors, were also impressed by the power of the work done as a group, both in terms of the support and in terms of the constructive critical reflection of the participants. During the retreat, the fellows received a detailed explanation of their transition to graduate status under the guidance of Jabir Asaqala, the head of the graduates unit at the Center.\n","html_content":"<p style=\"text-align:justify;\">As part of the concluding events of the Mandel Program for Local Leadership in Baqa al-Gharbiyye, in late May, the group went on a retreat at the Beit Daniel cultural center in Zichron Yaakov.<\/p>\n<p style=\"text-align:justify;\">The main purpose of the retreat was to give the fellows a space to share their experiences of the program with one another, discuss important points that they had experienced during the past two years, talk about missed opportunities for themselves or the group, and discuss the future leadership challenges that awaited them in their work. The retreat summed up the learning experiences through various stations: intellectual study, personal study, personal development, interpersonal feedback, the transition from fellows to graduates, and a general summary with Dr. Danielle Shani, the director of the Mandel Center for Leadership in the North.<\/p>\n<p style=\"text-align:justify;\">In general, it emerged that the program was very meaningful for the fellows. All of them favorably acknowledged the development they had undergone, as well as the relationships and work experiences they had in the group. Shahira Shalaby and Dr. Asaf Turgeman, the program directors, were also impressed by the power of the work done as a group, both in terms of the support and in terms of the constructive critical reflection of the participants. During the retreat, the fellows received a detailed explanation of their transition to graduate status under the guidance of Jabir Asaqala, the head of the graduates unit at the Center.<\/p>\n","images":[],"attachments":[],"outer_links":[]},"a-meeting-with-mk-aida-touma-sliman":{"title":"Civic Identity: A Meeting with MK Aida Touma-Sliman","date":"2016-05-25","image":"https:\/\/north.mandelfoundation.org.il\/english\/SiteCollectionImages\/News\/Civil%20Identity_Small.jpg","excerpt":"Joint List Knesset Member discusses the creation of a common civic identity with graduates and fellows of the Mandel Center for Leadership in the North ","link":"https:\/\/north.mandelfoundation.org.il\/english\/About\/News\/Pages\/A-Meeting-with-MK-Aida-Touma-Sliman.aspx","is_inner":"yes","slug":"a-meeting-with-mk-aida-touma-sliman","text":"In early May, 2016, the graduates and fellows of the Mandel Center for Leadership in the North concluded a series of encounters entitled \"Identity: From Philosophy to Political Story.\"  MK Aida Touma-Sliman of the Joint List (Hadash, Raam, Balad, Taal) was the guest speaker at the final session. She spoke with the participants about civic identity and the complexity of creating a common civic identity for all of Israel's citizens against the background of the conflictual reality and the ideological and political rifts in Israeli society.\nMK Touma-Sliman shared her optimism with the participants. She believes that a common civic identity can be promoted in Israel, and even set forth the conditions and changes that are necessary for making it happen.\nThe three previous sessions in the series were entitled \"Identity and Multicultural Discourse,\" with Dr. Yuval Evri; \"Ethnic Identity,\" with social activist and poet Shlomi Hatuka; and \"Class Identity,\" with Dr. Ami Vatury. Staff member Dr. Asaf Turgeman facilitated the meetings, which were held as part of the continuing education programs of the Mandel Center for Leadership in the North.\n","html_content":"<p style=\"text-align:justify;\">In early May, 2016, the graduates and fellows of the Mandel Center for Leadership in the North concluded a series of encounters entitled \"Identity: From Philosophy to Political Story.\"&nbsp; MK Aida Touma-Sliman of the Joint List (Hadash, Raam, Balad, Taal) was the guest speaker at the final session. She spoke with the participants about civic identity and the complexity of creating a common civic identity for all of Israel's citizens against the background of the conflictual reality and the ideological and political rifts in Israeli society.<\/p>\n<p style=\"text-align:justify;\">MK Touma-Sliman shared her optimism with the participants. She believes that a common civic identity can be promoted in Israel, and even set forth the conditions and changes that are necessary for making it happen.<\/p>\n<p style=\"text-align:justify;\">The three previous sessions in the series were entitled \"Identity and Multicultural Discourse,\" with Dr. Yuval Evri; \"Ethnic Identity,\" with social activist and poet Shlomi Hatuka; and \"Class Identity,\" with Dr. Ami Vatury. Staff member Dr. Asaf Turgeman facilitated the meetings, which were held as part of the continuing education programs of the Mandel Center for Leadership in the North.<\/p>\n","images":[],"attachments":[],"outer_links":[]},"a-round-table-discussion-in-baqa-al-gharbiyye":{"title":"A Round-Table Discussion in Baqa al-Gharbiyye","date":"2016-05-10","image":"https:\/\/north.mandelfoundation.org.il\/english\/SiteCollectionImages\/News\/roundtables-may-2016_Small.jpg","excerpt":"Fellows of the Mandel Program for Local Leadership in Baqa al-Gharbiyye presented their projects to the mayor and local activists ","link":"https:\/\/north.mandelfoundation.org.il\/english\/About\/News\/Pages\/A-Round-Table-Discussion-in-Baqa-al-Gharbiyye.aspx","is_inner":"yes","slug":"a-round-table-discussion-in-baqa-al-gharbiyye","text":"On May 10, 2016, the Mandel Program for Local Leadership in Baqa al-Gharbiyye held a round-table event at Elkasami College. Approximately 150 of the city's residents attended, including Mayor Morsi Abu Mukh, who gave a speech praising the members of the group for their important work. Also in attendance were municipality department heads, educators, and community activists in various fields.\nThe purpose of the event was to acquaint Baqa's local leadership and residents, as well as members of the local authority, with the work of the fellows of the Mandel Program and to mobilize interested parties in the social, educational, and municipal fields to promote the various projects that were developed over the past two years, when the program has been underway in the city.\nAt the meeting, group members presented posters that they designed to describe their projects and social activism. An exhibition of installations depicting the city of Baqa al-Gharbiyye in the present and in the future was also mounted. Lastly was the meeting's main event: round-table discussions on five topics: sustainability and volunteerism, young people and informal education, early childhood, women in the public space, and Baqa: A Child-Friendly City.\nAt each table sat 12 to 15 participants who had been invited by the program fellows. The organizers considered the event, which was facilitated ably by group member Nura Sharif Abu Husien, a bridgehead for action on a wider scale with the cooperation of the entire population of Baqa al-Gharbiyye.\n","html_content":"<p style=\"text-align:justify;\">On May 10, 2016, the Mandel Program for Local Leadership in Baqa al-Gharbiyye held a round-table event at Elkasami College. Approximately 150 of the city's residents attended, including Mayor Morsi Abu Mukh, who gave a speech praising the members of the group for their important work. Also in attendance were municipality department heads, educators, and community activists in various fields.<\/p>\n<p style=\"text-align:justify;\">The purpose of the event was to acquaint Baqa's local leadership and residents, as well as members of the local authority, with the work of the fellows of the Mandel Program and to mobilize interested parties in the social, educational, and municipal fields to promote the various projects that were developed over the past two years, when the program has been underway in the city.<\/p>\n<p style=\"text-align:justify;\">At the meeting, group members presented posters that they designed to describe their projects and social activism. An exhibition of installations depicting the city of Baqa al-Gharbiyye in the present and in the future was also mounted. Lastly was the meeting's main event: round-table discussions on five topics: sustainability and volunteerism, young people and informal education, early childhood, women in the public space, and Baqa: A Child-Friendly City.<\/p>\n<p style=\"text-align:justify;\">At each table sat 12 to 15 participants who had been invited by the program fellows. The organizers considered the event, which was facilitated ably by group member Nura Sharif Abu Husien, a bridgehead for action on a wider scale with the cooperation of the entire population of Baqa al-Gharbiyye. <\/p>\n","images":[],"attachments":[],"outer_links":[]},"the-mandel-community-in-the-north-holds-a-day-of-learning-and-connecting":{"title":"Mandel Community in North Explores Challenges in Acre","date":"2016-05-09","image":"https:\/\/north.mandelfoundation.org.il\/english\/SiteCollectionImages\/News\/akko_2-640_Small.jpg","excerpt":"Graduates, fellows, and staff members of the Mandel community in the North explored the challenges of the city of Acre with local activists ","link":"https:\/\/north.mandelfoundation.org.il\/english\/About\/News\/Pages\/The-Mandel-Community-in-the-North-Holds-a-Day-of-Learning-and-Connecting.aspx","is_inner":"yes","slug":"the-mandel-community-in-the-north-holds-a-day-of-learning-and-connecting","text":"On April 20, 2016, members of the Mandel community in the North – 70 graduates, fellows, and members of the coordinating staff – met in Acre for a day of learning and connecting.\nThe meeting began with a reception and work in small groups to enable participants from different places to get to know one another. A high point of the day was when participants learned about the work of six graduates who presented their work in two parallel sessions. Another highlight was a walking tour, of the city of Acre, conducted in groups, which enabled participants to meet six social activists who live in the city. Each group gathered in a different café to meet a local activist who spoke to them about Acre, its challenges, and the social activities that he leads or in which he is involved.\nThe atmosphere, introductions, connections, study, and experiences were above and beyond all expectations, and the general sense was that the groundwork had been laid for establishing a Mandel community that is active and connected.\n","html_content":"<p style=\"text-align:justify;\">On April 20, 2016, members of the Mandel community in the North – 70 graduates, fellows, and members of the coordinating staff – met in Acre for a day of learning and connecting.<\/p>\n<p style=\"text-align:justify;\">The meeting began with a reception and work in small groups to enable participants from different places to get to know one another. A high point of the day was when participants learned about the work of six graduates who presented their work in two parallel sessions. Another highlight was a walking tour, of the city of Acre, conducted in groups, which enabled participants to meet six social activists who live in the city. Each group gathered in a different café to meet a local activist who spoke to them about Acre, its challenges, and the social activities that he leads or in which he is involved.<\/p>\n<p style=\"text-align:justify;\">The atmosphere, introductions, connections, study, and experiences were above and beyond all expectations, and the general sense was that the groundwork had been laid for establishing a Mandel community that is active and connected.<\/p>\n","images":[],"attachments":[],"outer_links":[]},"equality-inequality":{"title":"Equality, Inequality, and the Tebeka High Court Ruling","date":"2016-05-03","image":"https:\/\/north.mandelfoundation.org.il\/english\/SiteCollectionImages\/News\/afula_2-5-16_Small.jpg","excerpt":"Mandel leadership program in Afula hosts sessions with theater professionals to examine ruling on school rejection of Ethiopian students ","link":"https:\/\/north.mandelfoundation.org.il\/english\/About\/News\/Pages\/equality-inequality.aspx","is_inner":"yes","slug":"equality-inequality","text":"Over the last few weeks at the Mandel Program for Local Leadership in Afula, we have focused on the topic of \"Equality and Inequality,\" as part of our efforts to broaden the perspectives of our fellows on substantial social issues. We held a series of sessions led by the theater professionals Renana Raz and Ofer Amram, in which we examined the Tebeka High Court of Justice ruling and produced an audio presentation on this important legal event.\nThe Tebeka nonprofit, which advocates for justice and equality for Ethiopian-Israelis, petitioned the High Court of Justice over the non-acceptance of Ethiopian-Israeli students to Orthodox religious schools in Petah Tikva that are not official state schools but are recognized by the Ministry of Education. The petition was filed against the Petah Tikva municipality and the Ministry of Education. In 2011, the Court ruled that the right to equality in education overrides the right of any group to its own separate educational institutions:\n\"The refusal of any educational institution – regardless of its status within the education system – to accept pupils on grounds of their ethnic origin or community affiliation directly contradicts the principles and founding values of the constitutional-democratic system in Israel, by which all Israeli residents are bound. Incidents of inequality and discrimination are fundamentally unacceptable, and the relevant authorities are required to act with determination to eradicate them, using the full force of the authority granted to them by law.\"\nWe decided to involve Renana Raz and Ofer Amram in our work on the basis of their play \"The Hearing.\" In this play, they read out the protocol of the hearing given to Adam Varta, a high-school philosophy teacher, by the Ministry of Education and the ORT Educational Network, after he expressed his political opinions in a class that he was teaching. In the play, the actors swap roles, alternately presenting the perspective of each side in the affair. We asked them to carry out a similar group activity with our fellows in order to explore the Tebeka ruling and its consequences.\nLed by Raz and Amram, the group conducted close readings of the protocols of the court proceedings, of the Bass Commission, and of the Knesset Education Committee, as well as correspondence between Tebeka, the Ministry of Education, the Petah Tikva municipality, and the parents of the children who were rejected by the school. The fellows then prepared audio recordings made in their own family and social environments, when their families encountered different kinds of inequality or discrimination.\nAt the end of the process, Raz and Amram prepared a \"radio program\" that summarized the fellows' study of the Tebeka ruling. The program consisted of recordings of the story of the event as told by the fellows themselves.\n","html_content":"<p style=\"text-align:justify;\">Over the last few weeks at the Mandel Program for Local Leadership in Afula, we have focused on the topic of \"Equality and Inequality,\" as part of our efforts to broaden the perspectives of our fellows on substantial social issues. We held a series of sessions led by the theater professionals Renana Raz and Ofer Amram, in which we examined the Tebeka High Court of Justice ruling and produced an audio presentation on this important legal event. <\/p>\n<p style=\"text-align:justify;\">The Tebeka nonprofit, which advocates for justice and equality for Ethiopian-Israelis, petitioned the High Court of Justice over the non-acceptance of Ethiopian-Israeli students to Orthodox religious schools in Petah Tikva that are not official state schools but are recognized by the Ministry of Education. The petition was filed against the Petah Tikva municipality and the Ministry of Education. In 2011, the Court ruled that the right to equality in education overrides the right of any group to its own separate educational institutions:<\/p>\n<p style=\"text-align:justify;\">\"The refusal of any educational institution – regardless of its status within the education system – to accept pupils on grounds of their ethnic origin or community affiliation directly contradicts the principles and founding values of the constitutional-democratic system in Israel, by which all Israeli residents are bound. Incidents of inequality and discrimination are fundamentally unacceptable, and the relevant authorities are required to act with determination to eradicate them, using the full force of the authority granted to them by law.\"<\/p>\n<p style=\"text-align:justify;\">We decided to involve Renana Raz and Ofer Amram in our work on the basis of their play \"The Hearing.\" In this play, they read out the protocol of the hearing given to Adam Varta, a high-school philosophy teacher, by the Ministry of Education and the ORT Educational Network, after he expressed his political opinions in a class that he was teaching. In the play, the actors swap roles, alternately presenting the perspective of each side in the affair. We asked them to carry out a similar group activity with our fellows in order to explore the Tebeka ruling and its consequences. <\/p>\n<p style=\"text-align:justify;\">Led by Raz and Amram, the group conducted close readings of the protocols of the court proceedings, of the Bass Commission, and of the Knesset Education Committee, as well as correspondence between Tebeka, the Ministry of Education, the Petah Tikva municipality, and the parents of the children who were rejected by the school. The fellows then prepared audio recordings made in their own family and social environments, when their families encountered different kinds of inequality or discrimination.<\/p>\n<p style=\"text-align:justify;\">At the end of the process, Raz and Amram prepared a \"radio program\" that summarized the fellows' study of the Tebeka ruling. The program consisted of recordings of the story of the event as told by the fellows themselves.<\/p>\n","images":[],"attachments":[],"outer_links":[]},"afula-first-retreat":{"title":"Mandel Afula Program Holds Retreat in Jerusalem","date":"2016-04-11","image":"https:\/\/north.mandelfoundation.org.il\/english\/SiteCollectionImages\/News\/Afula_retreat2016_Small.jpg","excerpt":"Fellows of the Local Leadership program spend two days in Jerusalem, exploring public policy design and implementation ","link":"https:\/\/north.mandelfoundation.org.il\/english\/About\/News\/Pages\/Afula-first-Retreat.aspx","is_inner":"yes","slug":"afula-first-retreat","text":"At the end of March, fellows of the Mandel Program for Local Leadership in Afula convened for a two-day retreat in Jerusalem, on the subject of Public Policy Design and Implementation.\nThe first day began with a tour of the Supreme Court. The fellows learned about the architectural design of the building, the different types of judicial activity that take place there, and the Supreme Court justices themselves. The group met with Justice Anat Baron, and heard about the influence of the Supreme Court on public policy in Israel and the role of the court in defending democracy and curbing anti-democratic tendencies. Justice Baron also spoke about issues currently on the public agenda, such as the proposed agreement for exploiting Israel's newly-discovered natural gas reserves. This was a unique opportunity to hear about the professional work of Supreme Court justices first-hand.\nNext, the fellows met with Danny Bar Giora, director of the Mandel School for Educational Leadership, who shared insights into policy questions that he developed in three positions he has held: high school principal, head of the Jerusalem education administration, and head of implementation for the Ministry of Education's New Horizon (\"Ofek Hadash\") reforms. Dr. Neta Sher-Hadar, head of policy studies at the School, described the complexities of the field of public policy, in terms of both research and practice, and presented some of the key questions asked about and within the field.\nOn the second day of the retreat, the fellows met with Gil Rivosh, director of the strategy department of the Jerusalem municipality, and with Yael Gabai, who is responsible for the municipality's plan for employment and exit from poverty. For the fellows, this was a truly revolutionary meeting. They were presented with some impressive strategic thinking, based on data collection and on cooperation with different bodies, which was carried out in order to identify the target populations that need the most intensive interventions. The two leaders explained in detail the long and painstaking process they had undergone in order to reach the best possible formula. Their honesty, their willingness to speak about failed attempts, and most of all their seriousness and professionalism, impressed the group enormously.\nFollowing this, the group visited the budget division at the Ministry of Finance, where the coordinator of macro-budgeting, Ilya Katz, explained the division's work, its guiding principles, and its vision. In a relatively short meeting, Ilya managed to undermine several popular and widely-held conceptions about the ministry and its work. At the end, the fellows expressed their interest in learning much more about the subject.\nThe final meeting of the retreat took place at the Knesset, where fellows met with Dr. Shirley Avrami, director of the Knesset Research and Information Center. Dr. Avrami described the pivotal importance and influence that the center and the data that its researchers collect have on MKs and on the legislative process.\nThe program directors, Ayelet Ilany and Dalit Caspin, were impressed by the fellows' immense interest in the various subject areas they encountered. Almost all the fellows reported that most of the information they heard was new to them, and said that they intended to learn more about it.\n","html_content":"<p style=\"text-align:justify;\">At the end of March, fellows of the Mandel Program for Local Leadership in Afula convened for a two-day retreat in Jerusalem, on the subject of Public Policy Design and Implementation.<\/p>\n<p style=\"text-align:justify;\">The first day began with a tour of the Supreme Court. The fellows learned about the architectural design of the building, the different types of judicial activity that take place there, and the Supreme Court justices themselves. The group met with Justice Anat Baron, and heard about the influence of the Supreme Court on public policy in Israel and the role of the court in defending democracy and curbing anti-democratic tendencies. Justice Baron also spoke about issues currently on the public agenda, such as the proposed agreement for exploiting Israel's newly-discovered natural gas reserves. This was a unique opportunity to hear about the professional work of Supreme Court justices first-hand.<\/p>\n<p style=\"text-align:justify;\">Next, the fellows met with Danny Bar Giora, director of the Mandel School for Educational Leadership, who shared insights into policy questions that he developed in three positions he has held: high school principal, head of the Jerusalem education administration, and head of implementation for the Ministry of Education's New Horizon (\"Ofek Hadash\") reforms. Dr. Neta Sher-Hadar, head of policy studies at the School, described the complexities of the field of public policy, in terms of both research and practice, and presented some of the key questions asked about and within the field.<\/p>\n<p style=\"text-align:justify;\">On the second day of the retreat, the fellows met with Gil Rivosh, director of the strategy department of the Jerusalem municipality, and with Yael Gabai, who is responsible for the municipality's plan for employment and exit from poverty. For the fellows, this was a truly revolutionary meeting. They were presented with some impressive strategic thinking, based on data collection and on cooperation with different bodies, which was carried out in order to identify the target populations that need the most intensive interventions. The two leaders explained in detail the long and painstaking process they had undergone in order to reach the best possible formula. Their honesty, their willingness to speak about failed attempts, and most of all their seriousness and professionalism, impressed the group enormously.<\/p>\n<p style=\"text-align:justify;\">Following this, the group visited the budget division at the Ministry of Finance, where the coordinator of macro-budgeting, Ilya Katz, explained the division's work, its guiding principles, and its vision. In a relatively short meeting, Ilya managed to undermine several popular and widely-held conceptions about the ministry and its work. At the end, the fellows expressed their interest in learning much more about the subject.<\/p>\n<p style=\"text-align:justify;\">The final meeting of the retreat took place at the Knesset, where fellows met with Dr. Shirley Avrami, director of the Knesset Research and Information Center. Dr. Avrami described the pivotal importance and influence that the center and the data that its researchers collect have on MKs and on the legislative process.<\/p>\n<p style=\"text-align:justify;\">The program directors, Ayelet Ilany and Dalit Caspin, were impressed by the fellows' immense interest in the various subject areas they encountered. Almost all the fellows reported that most of the information they heard was new to them, and said that they intended to learn more about it.<\/p>\n","images":[],"attachments":[],"outer_links":[]},"bimat-mandel-in-the-north":{"title":"Dilemmas in the Encounter between Tradition and Modernity","date":"2016-04-11","image":"https:\/\/north.mandelfoundation.org.il\/english\/SiteCollectionImages\/News\/alaa_halihal_Small.jpg","excerpt":"A “Mandel Platform” event with the writer Ala Hlehel explored processes under way in Israeli society in general and in Arab society in particular ","link":"https:\/\/north.mandelfoundation.org.il\/english\/About\/News\/Pages\/Bimat-Mandel-in-the-North.aspx","is_inner":"yes","slug":"bimat-mandel-in-the-north","text":"​On April 11, 2016, a Bimat Mandel event took place at which the writer Ala Hlehel gave a lecture and facilitated a fascinating discussion about the tumultuous and sometimes even violent encounters between tradition and modernity. Hlehel spoke about the unspoken clashes and the challenges that these encounters pose to us. He expressed strong and courageous views about religious-traditional coercion and about the exclusion of dialogue and of \"enlightened and progressive values\" from the conversation.\nDuring the meeting with Ala Hlehel, the participants held a profound, critical, and courageous discussion about the processes that are under way in Israeli society in general and in Arab society in particular.\n","html_content":"<p>​On April 11, 2016, a Bimat Mandel event took place at which the writer Ala Hlehel gave a lecture and facilitated a fascinating discussion about the tumultuous and sometimes even violent encounters between tradition and modernity. Hlehel spoke about the unspoken clashes and the challenges that these encounters pose to us. He expressed strong and courageous views about religious-traditional coercion and about the exclusion of dialogue and of \"enlightened and progressive values\" from the conversation.<\/p>\n<p>During the meeting with Ala Hlehel, the participants held a profound, critical, and courageous discussion about the processes that are under way in Israeli society in general and in Arab society in particular.<\/p>\n","images":[],"attachments":[],"outer_links":[]},"human-networks-and-leadership":{"title":"Human Networks and Leadership","date":"2016-03-23","image":"https:\/\/north.mandelfoundation.org.il\/english\/SiteCollectionImages\/News\/human-networks_Small.jpg","excerpt":"Graduates and fellows of Mandel Programs for Local Leadership in the North learn about personal and group networks from a psychologist ","link":"https:\/\/north.mandelfoundation.org.il\/english\/About\/News\/Pages\/Human-Networks-and-Leadership.aspx","is_inner":"yes","slug":"human-networks-and-leadership","text":"On March 20, graduates and fellows of Mandel Programs for Local Leadership in the North gathered to learn about human networks. The session was led by Smadar Porat, a psychologist, faculty member at the College of Education, and researcher of networks and leadership. The workshop was the third in a series offered to graduates by the Mandel Center for Leadership in the North.\nParticipants in the workshop learned about basic concepts in network-oriented thinking and analyzed social phenomena from this perspective. They also explored key concepts in human networks, practiced analyzing personal and group networks, and examined applied aspects of these ideas in their own areas of practice and influence.\n","html_content":"<p style=\"text-align:justify;\">On March 20, graduates and fellows of Mandel Programs for Local Leadership in the North gathered to learn about human networks. The session was led by Smadar Porat, a psychologist, faculty member at the College of Education, and researcher of networks and leadership. The workshop was the third in a series offered to graduates by the Mandel Center for Leadership in the North.<\/p>\n<p style=\"text-align:justify;\">Participants in the workshop learned about basic concepts in network-oriented thinking and analyzed social phenomena from this perspective. They also explored key concepts in human networks, practiced analyzing personal and group networks, and examined applied aspects of these ideas in their own areas of practice and influence.<\/p>\n","images":[],"attachments":[],"outer_links":[]},"migdal-haemek-graduates-meet-with-pnina-motzafi-haller":{"title":"Migdal HaEmek Graduates Meet with Prof. Pnina Motzafi-Haller","date":"2016-03-23","image":"https:\/\/north.mandelfoundation.org.il\/english\/SiteCollectionImages\/News\/Pnina-Motzafi-Haller-Migdal-Grads-3-2016_Small.jpg","excerpt":"Graduates of the Mandel Program for Local Leadership in Migdal HaEmek explore the meaning of success for Israelis born in development towns ","link":"https:\/\/north.mandelfoundation.org.il\/english\/About\/News\/Pages\/Migdal-HaEmek-Graduates-Meet-with-Pnina-Motzafi-Haller.aspx","is_inner":"yes","slug":"migdal-haemek-graduates-meet-with-pnina-motzafi-haller","text":"Graduates of the Mandel Program for Local Leadership in Migdal HaEmek met for an in-depth conversation with Prof. Pnina Motzafi-Haller – an anthropologist and lecturer at Ben-Gurion University of the Negev, a social activist, and a feminist leader. The meeting explored the meaning of success for people born in Israel's development towns.\nProf. Motzafi-Haller, herself a native of Migdal HaEmek, shared her own story, from her childhood in Migdal HaEmek through to her current academic vocation. She spoke about two formative research studies she conducted: one a field study in Botswana, and the other in Yeruham, a development town in southern Israel. She focused on the question of success and failure as seen from anthropological, ethical, and feminist perspectives.\nThe ensuing discussion revolved around dilemmas faced by women (and by others) in development towns: What is success? What does it mean?  What does it cost? The participants also related to the question of residents staying in development towns or leaving them, and to the personal and social meanings associated with this issue, which is of great concern to local leaders.\n","html_content":"<p style=\"text-align:justify;\">Graduates of the Mandel Program for Local Leadership in Migdal HaEmek met for an in-depth conversation with Prof. Pnina Motzafi-Haller – an anthropologist and lecturer at Ben-Gurion University of the Negev, a social activist, and a feminist leader. The meeting explored the meaning of success for people born in Israel's development towns.<\/p>\n<p style=\"text-align:justify;\">Prof. Motzafi-Haller, herself a native of Migdal HaEmek, shared her own story, from her childhood in Migdal HaEmek through to her current academic vocation. She spoke about two formative research studies she conducted: one a field study in Botswana, and the other in Yeruham, a development town in southern Israel. She focused on the question of success and failure as seen from anthropological, ethical, and feminist perspectives.<\/p>\n<p style=\"text-align:justify;\">The ensuing discussion revolved around dilemmas faced by women (and by others) in development towns: What is success? What does it mean?&nbsp; What does it cost? The participants also related to the question of residents staying in development towns or leaving them, and to the personal and social meanings associated with this issue, which is of great concern to local leaders.<\/p>\n","images":[],"attachments":[],"outer_links":[]},"baqa-retreat":{"title":"Mandel Baqa al-Gharbiyye Program Holds Retreat in Kibbutz Dalia","date":"2016-02-17","image":"https:\/\/north.mandelfoundation.org.il\/english\/SiteCollectionImages\/News\/Baqa-retreat-2016_Small.jpg","excerpt":"Fellows of the Mandel Program for Local Leadership in Baqa al-Gharbiyye participate in a two-day retreat in January at Kibbutz Dalia in the north ","link":"https:\/\/north.mandelfoundation.org.il\/english\/About\/News\/Pages\/Baqa-retreat.aspx","is_inner":"yes","slug":"baqa-retreat","text":"At the end of January, the fellows of the Mandel Program for Local Leadership in Baqa al-Gharbiyye met for a two-day retreat at Kibbutz Dalia in northern Israel. The aim of the retreat was to inspire and encourage creativity, and to develop the fellows' ability to view reality (and especially their own areas of practice) through different and diverse perspectives.\nThe first day began with a voice training workshop – \"Becoming an Echo Chamber\" – led by Yahli Toren, a professional opera singer, voice coach, and music therapist. The workshop acted as an icebreaker, and helped the fellows attain impressive vocal capabilities.\nNext, the group met with the poet Yonadav Kaplan, who led a workshop based on the haiku poems of the Japanese poet Basho. The group learned about the haiku technique, and about how this form of poetry reflects the experience and vision of the individual, helping the individual reach a new and invigorating understanding of self. At the end of the workshop, the fellows wrote some impressive haiku poems expressing various aspects of their life experience and their social and public activity.\nThe second day was devoted to processing and learning from the workshops of the first day. The fellows created pictures that showed how the workshops had informed their different worlds of practice and influenced their own individual visions.\nThis is the second year of the Mandel Program for Local Leadership in Baqa al-Gharbiyye, which is being run in partnership with the Baqa al-Gharbiyye municipality. The directors of the program are Mandel Center for Leadership in the North faculty members Shahira Shalaby and Dr. Yosef Turgeman.\n","html_content":"<p style=\"text-align:justify;\">At the end of January, the fellows of the Mandel Program for Local Leadership in Baqa al-Gharbiyye met for a two-day retreat at Kibbutz Dalia in northern Israel. The aim of the retreat was to inspire and encourage creativity, and to develop the fellows' ability to view reality (and especially their own areas of practice) through different and diverse perspectives.<\/p>\n<p style=\"text-align:justify;\">The first day began with a voice training workshop – \"Becoming an Echo Chamber\" – led by Yahli Toren, a professional opera singer, voice coach, and music therapist. The workshop acted as an icebreaker, and helped the fellows attain impressive vocal capabilities.<\/p>\n<p style=\"text-align:justify;\">Next, the group met with the poet Yonadav Kaplan, who led a workshop based on the haiku poems of the Japanese poet Basho. The group learned about the haiku technique, and about how this form of poetry reflects the experience and vision of the individual, helping the individual reach a new and invigorating understanding of self. At the end of the workshop, the fellows wrote some impressive haiku poems expressing various aspects of their life experience and their social and public activity. <\/p>\n<p style=\"text-align:justify;\">The second day was devoted to processing and learning from the workshops of the first day. The fellows created pictures that showed how the workshops had informed their different worlds of practice and influenced their own individual visions.<\/p>\n<p style=\"text-align:justify;\">This is the second year of the Mandel Program for Local Leadership in Baqa al-Gharbiyye, which is being run in partnership with the Baqa al-Gharbiyye municipality. The directors of the program are Mandel Center for Leadership in the North faculty members Shahira Shalaby and Dr. Yosef Turgeman.<\/p>\n","images":[],"attachments":[],"outer_links":[]},"medias-impact-on-righting-social-wrongs":{"title":"The Media’s Impact on Righting Social Wrongs","date":"2016-02-06","image":"https:\/\/north.mandelfoundation.org.il\/english\/SiteCollectionImages\/News\/bimat-mandel-feb-2016_Small.jpg","excerpt":"Graduates, fellows, and faculty of the Mandel Center for Leadership in the North joined journalists in exploring how the media addresses social issues ","link":"https:\/\/north.mandelfoundation.org.il\/english\/About\/News\/Pages\/Medias-Impact-on-Righting-Social-Wrongs.aspx","is_inner":"yes","slug":"medias-impact-on-righting-social-wrongs","text":"On February 2, 2016, the Mandel Center for Leadership in the North hosted the second in a series of Mandel Platform events in the North on the topic of \"Influence.\"   Approximately 40 graduates, fellows, and faculty members of the Center gathered to explore \"The Influence of the Media on Righting Social Wrongs.\"\nThe event featured journalist Keren Neubach, host of the IBA Reshet Bet radio show \"Seder Yom\" (Agenda). Following her opening address, participants engaged in a discussion of social issues, the working methods of the media in general and of \"Seder Yom\" in particular, the program's successes and failures in addressing social issues, and more. Neubach invited the participants to suggest topics related to social injustice for discussion on her radio program in the future.\nThe first event in this series was held in December 2015 and explored \"The Social Influence of Humor and Satire.\"  The third and last event in the series, which examined the influence of literature on moral dilemmas, was scheduled for the beginning of April. \n","html_content":"<p style=\"text-align:justify;\">On February 2, 2016, the Mandel Center for Leadership in the North hosted the second in a series of Mandel Platform events in the North on the topic of \"Influence.\" &nbsp;&nbsp;Approximately 40 graduates, fellows, and faculty members of the Center gathered to explore \"The Influence of the Media on Righting Social Wrongs.\" <\/p>\n<p style=\"text-align:justify;\">The event featured journalist Keren Neubach, host of the IBA Reshet Bet radio show \"Seder Yom\" (Agenda). Following her opening address, participants engaged in a discussion of social issues, the working methods of the media in general and of \"Seder Yom\" in particular, the program's successes and failures in addressing social issues, and more. Neubach invited the participants to suggest topics related to social injustice for discussion on her radio program in the future.<\/p>\n<p style=\"text-align:justify;\">The first event in this series was held in December 2015 and explored \"The Social Influence of Humor and Satire.\" &nbsp;The third and last event in the series, which examined the influence of literature on moral dilemmas, was scheduled for the beginning of April.&nbsp;<\/p>\n","images":[],"attachments":[],"outer_links":[]},"akko-convention-on-urbanism":{"title":"Afula Fellows Participate in Akko Convention on Urbanism","date":"2015-11-29","image":"https:\/\/north.mandelfoundation.org.il\/english\/SiteCollectionImages\/News\/akko-summit_Small.jpg","excerpt":"As part of their studies about their city, fellows of the Mandel Program for Local Leadership in Afula took part in the first Akko Convention on Urbanism ","link":"https:\/\/north.mandelfoundation.org.il\/english\/About\/News\/Pages\/Akko-Convention-on-Urbanism.aspx","is_inner":"yes","slug":"akko-convention-on-urbanism","text":"","html_content":"","images":[],"attachments":[],"outer_links":[]},"celebratory-event-launches-the-new-year":{"title":"Celebratory Event Launches New Year","date":"2015-11-02","image":"https:\/\/north.mandelfoundation.org.il\/english\/SiteCollectionImages\/News\/Meir%20Buzaglo_Small.jpg","excerpt":"The new academic year was launched at a celebratory event attended by members of the Mandel community in the North - fellows, graduates and staff members ","link":"https:\/\/north.mandelfoundation.org.il\/english\/About\/News\/Pages\/Celebratory-Event-Launches-the-New-Year.aspx","is_inner":"yes","slug":"celebratory-event-launches-the-new-year","text":"The 2015-2016 academic year at the Mandel Center for Leadership in the North was launched on September 8 with a celebratory event attended by members of the Mandel community in the North - fellows, graduates, tutors and staff members - from the southern and northern Triangle, the Yezreel Valley and the Galilee.\nThe evening began with addresses from the center's director, Dr. Danielle Shani, and from representatives of the fellows and graduates: Naeemah Keadan, Yair Afik, Awny Massarwah and Dafna Hasan. The representatives related stories, read poems and spoke about the meaning of the upcoming holidays - the Jewish Rosh Hashanah and the Muslim Eid al-Adha.\nThe keynote lecture of the event was given by Dr. Meir Buzaglo, who spoke about leadership, tradition, identity and citizenship. Buzaglo, a lecturer of philosophy at the Hebrew University of Jerusalem, talked about the importance for leadership of values in general, and of compassion in particular; about the importance of leaders’ connection to their sources of identity and tradition; and about the ability of his audience - the Mandel community in the North - to propose an alternative vision for the existing reality between Jews and Arabs, and not just for the North.\nFollowing a festive dinner at the Tandokah restaurant in Yokne'am, there was a performance from the award-winning musician and oud player Wisam Jubran, who played a number of his own compositions in an atmosphere of togetherness and hope.\n","html_content":"<p style=\"text-align:justify;\">\n                   The 2015-2016 academic year at the Mandel Center for Leadership in the North was launched on September 8 with a celebratory event attended by members of  the Mandel community in the North - fellows, graduates, tutors and staff members - from the southern and northern Triangle, the Yezreel  Valley and the Galilee.<\/p>\n<p style=\"text-align:justify;\">\n                   The evening began with addresses from the center's director, Dr. Danielle Shani, and from representatives of the fellows and graduates: Naeemah Keadan, Yair Afik, Awny Massarwah and Dafna Hasan. The representatives related stories, read poems and spoke about the meaning of the upcoming holidays - the Jewish Rosh Hashanah and the Muslim Eid al-Adha.<\/p>\n<p style=\"text-align:justify;\">The keynote lecture of the event was given by Dr. Meir Buzaglo, who spoke about leadership, tradition, identity and citizenship. Buzaglo, a lecturer of philosophy at the Hebrew University of Jerusalem, talked about the importance for leadership of values in general, and of compassion in particular; about the importance of leaders’ connection to their sources of identity and tradition; and about the ability of his audience - the Mandel community in the North - to propose an alternative vision for the existing reality between Jews and Arabs, and not just for the North.\n\n                <\/p>\n<p style=\"text-align:justify;\">\n    Following a festive dinner at the Tandokah restaurant in Yokne'am, there was a performance from the award-winning musician and oud player Wisam Jubran, who played a number of his own compositions in an atmosphere of togetherness and hope.\n<\/p>\n","images":[],"attachments":[],"outer_links":[]},"a-lesson-in-management-and-leadership":{"title":"A Lesson in Management and Leadership","date":"2015-08-04","image":"https:\/\/north.mandelfoundation.org.il\/english\/SiteCollectionImages\/News\/Lesson%20in%20Management_Small.jpg","excerpt":"Morton Mandel, chairman of the Mandel Foundation, visited Migdal HaEmek and met with Mayor Eli Barda and the participants  ","link":"https:\/\/north.mandelfoundation.org.il\/english\/About\/News\/Pages\/A-Lesson-in-Management-and-Leadership.aspx","is_inner":"yes","slug":"a-lesson-in-management-and-leadership","text":"The mayor and the Jewish philanthropist held a personal meeting, during which the mayor presented Migdal HaEmek’s development in a number of fields, with an emphasis on education and industry - both of which are close to Mandel’s heart. The guest thanked the mayor for his warm reception and spoke of being very impressed with his work. He also described his happiness that the Mandel leadership program had been launched in Migdal HaEmek two years ago, with the aim of developing local educational and social leadership and of creating deep and meaningful dialogue among the representatives of different and varied groups within the city.\nAt the end of the meeting, Mayor Barda presented the seal of the city to Mr. Mandel, who then proceeded to meet with the participants of the Mandel local leadership program, due to complete their studies at the end of the month. The participants introduced themselves to the chairman of the Mandel Foundation and to its Israeli directors and spoke about their studies and the importance of the subjects they have studied, such as municipal assets, multi-culturalism, leadership and “the worthy city.\"               \nMr. Mandel shared with the participants some of his rich experience of leading organizations, both business and philanthropic, saying that the guiding principle throughout his life has been that “it’s all about who,” and that therefore it is vital to invest in people. According to Mandel, professionals should always seek to improve themselves, to raise the bar and never to rest on their laurels.\nMayor Barda spoke about the meeting: “The meeting with Morton Mandel and with the participants of the Mandel leadership program in the city was very moving. His life path, from owner of a small family business to billionaire, and then as a philanthropist giving hundreds of millions of dollars to the Jewish people and Israel, is truly inspiring.\n","html_content":"<p style=\"text-align:justify;\">\n                    The mayor and the Jewish philanthropist held a personal meeting, during which the mayor presented Migdal HaEmek’s development in a number of fields, with an emphasis on education and industry -&nbsp;both of&nbsp;which are&nbsp;close to Mandel’s heart. The guest thanked the mayor for his warm reception and spoke of being very impressed with his work. He also described his happiness that the Mandel leadership program had been launched in Migdal HaEmek two years ago, with the aim of developing local educational and social leadership and of creating deep and meaningful dialogue among the representatives of different and varied groups within the city.\n                <\/p>\n<p style=\"text-align:justify;\">\n                    At the end of the meeting, Mayor Barda presented the seal of the city to Mr. Mandel, who then proceeded to meet with the participants of the Mandel local leadership program, due to complete their studies at the end of the month. The participants introduced themselves to the chairman of the Mandel Foundation and to its Israeli directors and spoke about their studies and the importance of the subjects they have studied, such as municipal assets, multi-culturalism, leadership and&nbsp;“the worthy city.\"&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; <\/p>\n<p style=\"text-align:justify;\">\n                    Mr. Mandel shared with the participants some of his rich experience of leading organizations, both business and philanthropic, saying that the guiding principle throughout his life has been that “it’s all about who,” and that therefore it is vital to invest in people. According to Mandel, professionals should always seek to improve themselves, to raise the bar and never to rest on their laurels.\n                <\/p>\n<p style=\"text-align:justify;\">\n                    Mayor Barda spoke about the meeting: “The meeting with Morton Mandel and with the participants of the Mandel leadership program in the city was very moving. His life path, from owner of a small family business to billionaire, and then as a philanthropist giving hundreds of millions of dollars to the Jewish people and Israel, is truly inspiring.\n                <\/p>\n","images":[],"attachments":[],"outer_links":[]},"midgal-haemek-program-draws-to-a-close":{"title":"Midgal HaEmek Graduation","date":"2015-08-04","image":"https:\/\/north.mandelfoundation.org.il\/english\/SiteCollectionImages\/News\/MigdalHaemek-2015_Small.jpg","excerpt":"Program participants present their final projects and their proposed directions for developing Migdal HaEmek at a meeting marking the culmination of the program, attended by the city’s mayor ","link":"https:\/\/north.mandelfoundation.org.il\/english\/About\/News\/Pages\/Midgal-HaEmek-Program-Draws-to-a-Close.aspx","is_inner":"yes","slug":"midgal-haemek-program-draws-to-a-close","text":"At a public meeting held to mark the culmination of the program, the participants presented aspects of their personal and public development, their final projects and their proposed directions for developing Migdal HaEmek. Their projects were presented in parallel discussion groups that dealt with a number of central themes: the identity, resilience and history of Migdal HaEmek; community development; development of local assets; personal and professional processes of change and growth; educational issues at the Ort Rogozin high school; informal education in Migdal HaEmek; and developing new programs and initiatives in the city.\nThe event, held on June 24, was attended by Mayor Eli Barda, who delivered a warm address to the program graduates and the audience, and also visited a number of the discussion groups. Participants were also given the opportunity to receive professional feedback from the various practitioners and academics who participated in the discussion groups, as well as from the faculty of the Mandel Center for Leadership in the North.\nThe graduation ceremony and the award of certificates to graduates was held a week later. Mayor Eli Barda expressed his personal thanks to Mr. Morton Mandel, who he met during the latter’s recent visit to Migdal HaEmek. Barda also thanked the Mandel Foundation, the Mandel Center for Leadership in the North and the center’s director, Dr. Danielle Shani, for their cooperation with the Migdal HaEmek municipality. He spoke of his belief in the graduates’ ability to influence and to lead significant change in the city, and called for collaboration between the municipality and the graduates in order to promote new ideas and initiatives.\nThe director-general of the Mandel Foundation-Israel, Moshe Vigdor, praised the current movement for change and action in Migdal HaEmek and expressed his hope and belief that the graduates would make their own contribution to it. Dr. Danielle Shani, director of the Mandel Center for Leadership in the North, also spoke, as did two program participants, and the program directors, Dalit Caspin and Ayelet Ilany. With their new certificates in hand, the participants officially became Mandel graduates.\n","html_content":"<p style=\"text-align:justify;\">\n                    At a public meeting held to mark the culmination of the program, the participants presented aspects of their personal and public development, their final projects and their proposed directions for developing Migdal HaEmek. Their projects were presented in parallel discussion groups that dealt with a number of central themes: the identity, resilience and history of Migdal HaEmek; community development; development of local assets; personal and professional processes of change and growth; educational issues at the Ort Rogozin high school; informal education in Migdal HaEmek; and developing new programs and initiatives in the city.\n                <\/p>\n<p style=\"text-align:justify;\">\n                    The event, held on June 24, was attended by Mayor Eli Barda, who delivered a warm address to the program graduates and the audience, and also visited a number of the discussion groups. Participants were also given the opportunity to&nbsp;receive professional&nbsp;feedback from the&nbsp;various practitioners and academics who participated in the discussion groups, as well as from the faculty of the Mandel Center for Leadership in the North.\n                <\/p>\n<p style=\"text-align:justify;\">\n                    The graduation ceremony and the award of certificates to graduates was held a week later. Mayor Eli Barda expressed his personal thanks to Mr. Morton Mandel, who&nbsp;he met during the latter’s recent visit to Migdal HaEmek. Barda also thanked the Mandel Foundation, the Mandel Center for Leadership in the North and the center’s director, Dr. Danielle Shani, for their cooperation with the Migdal HaEmek municipality. He spoke of his belief in the graduates’ ability to influence and to lead significant change in the city, and called for collaboration between the municipality and the graduates in order to promote new ideas and initiatives.\n\n                <\/p>\n<p style=\"text-align:justify;\">\n                    The director-general of the Mandel Foundation-Israel, Moshe Vigdor, praised the current movement for change and action in Migdal HaEmek and expressed his hope and belief that the graduates would make their own contribution to it. Dr. Danielle Shani, director of the Mandel Center for Leadership in the North, also spoke, as did two program participants, and the program directors, Dalit Caspin and Ayelet Ilany. With their new certificates in hand, the participants officially became Mandel graduates.\n                <\/p>\n","images":[],"attachments":[],"outer_links":[]},"a-visit-to-the-supreme-court":{"title":"A Visit to the Supreme Court","date":"2015-05-30","image":"https:\/\/north.mandelfoundation.org.il\/english\/SiteCollectionImages\/News\/Baqa-SupremeCourtvisit_Small.jpg","excerpt":"Participants of the Baqa al-Gharbiyye leadership program toured Jerusalem and met with Supreme Court Justice Anat Baron ","link":"https:\/\/north.mandelfoundation.org.il\/english\/About\/News\/Pages\/A-Visit-to-the-Supreme-Court.aspx","is_inner":"yes","slug":"a-visit-to-the-supreme-court","text":"At the end of May, the participants in the Mandel Program for Local Leadership in Baqa al- Gharbiyye visited Jerusalem as part of the study unit “The Worthy Person and the Just Society.” The group met with Supreme Justice Anat Baron, who spoke to them about the relationship between justice, law and the courts. In her lecture, Baron explored the differences between factual truth and legal truth, and between contextual truth and absolute truth. She discussed the uniqueness of the Basic Law “Human Dignity and Freedom” in the absence of a constitution in Israel, as well as the role of the Supreme Court as an independent authority providing an essential balance in democratic regimes in general, and in Israel in particular. Justice Baron also reviewed several cases that received widespread media coverage.\nDuring the second part of the meeting, the participants asked questions about the Supreme Court, such as the method for selecting justices and the need for it to represent all social strata, particularly given the relative nature of justice.\nAfterwards, the group took part in two guided tours examining the political and social situation in east Jerusalem. The first was a tour organized by the Ir Amim nonprofit, looking at the division of the city, the separation fence and the situation of the city’s Palestinian residents. The second was a tour of the Old City guided by Yassir Kos, who spoke about the complexities of life for the city’s Palestinians, the challenges of unemployment and poverty and the effects of the Residency Law. He also shared his personal and professional experiences of living in the Old City.\n","html_content":"<p style=\"text-align:justify;\">\n                    At the end of May, the participants in the Mandel Program for Local Leadership in Baqa al- Gharbiyye visited Jerusalem as part of the study unit “The Worthy Person and the Just Society.” The group met with Supreme Justice Anat Baron, who spoke to them about the relationship between justice, law and the courts. In her lecture, Baron explored the differences between factual truth and legal truth, and between contextual truth and absolute truth. She discussed the uniqueness of the Basic Law “Human Dignity and Freedom” in the absence of a constitution in Israel, as well as the role of the Supreme Court as an independent authority providing an essential balance in democratic regimes in general, and in Israel in particular. Justice Baron also reviewed several cases that received widespread media coverage.\n                <\/p>\n<p style=\"text-align:justify;\">\n                    During the second part of the meeting, the participants asked questions about the Supreme Court, such as the method for selecting justices and the need for it to represent all social strata, particularly given the relative nature of justice.\n                <\/p>\n<p style=\"text-align:justify;\">\n                    Afterwards, the group took part in two guided tours examining the political and social situation in east Jerusalem. The first was a tour organized by the Ir Amim nonprofit, looking at the division of the city, the separation fence and the situation of the city’s Palestinian residents. The second was a tour of the Old City guided by Yassir Kos, who spoke about the complexities of life for the city’s Palestinians, the challenges of unemployment and poverty and the effects of the Residency Law. He also shared his personal and professional experiences of living in the Old City.\n                <\/p>\n","images":[],"attachments":[],"outer_links":[]},"gala-opening-of-the-new-academic-year":{"title":"Gala Opening of New Academic Year","date":"2014-12-15","image":"https:\/\/north.mandelfoundation.org.il\/english\/SiteCollectionImages\/News\/MCN%20opening_Small.jpg","excerpt":"The two cohorts of fellows and the two groups of program graduates gathered with the faculty of the Mandel Center for Leadership in the North\n\n ","link":"https:\/\/north.mandelfoundation.org.il\/english\/About\/News\/Pages\/Gala-Opening-of-the-New-Academic-Year.aspx","is_inner":"yes","slug":"gala-opening-of-the-new-academic-year","text":"","html_content":"","images":[],"attachments":[],"outer_links":[]},"sammysmooha":{"title":"Prof. Sammy Smooha Visits the Mandel Center for Leadership in the North","date":"2014-12-03","image":"https:\/\/north.mandelfoundation.org.il\/english\/SiteCollectionImages\/News\/SammySmooha_Small.png","excerpt":"​Prof. Sammy Smooha was a guest of the Migdal HaEmek Leadership program and presented his ongoing study of Israel’s ethnic rift ","link":"https:\/\/north.mandelfoundation.org.il\/english\/About\/News\/Pages\/SammySmooha.aspx","is_inner":"yes","slug":"sammysmooha","text":"​Prof. Sammy Smooha was a guest of the Migdal HaEmek Leadership program and presented his ongoing study of Israel’s ethnic rift. Smooha, an Israel Prize laureate in sociology and a lecturer at the University of Haifa, presented a historical and social overview of the conditions that created the ethnic rift in Israel and explained the reasons why it persists even now - despite what he considers the prevailing tendency to downplay its intensity or completely deny its existence. Prof. Smooha presented four different theoretical perspectives on the development of ethnic relations in Israel: the assimilation approach (modernization and integration processes), the class-oriented approach, the post-colonial approach and the pluralistic approach, in which there is a critical discussion while developing or overlooking principles of the other perspectives.\nPresentation of these approaches allowed for fellows to consider the situation and engage in further discussion, while refining their personal outlooks and experiences. We took this opportunity to open the discussion to the community, and several fellows invited colleagues and relatives to attend the lecture. It was a successful effort that added to the program’s visibility in the city and enabled the fellows to expose those around them to their studies.\n","html_content":"<p style=\"text-align:justify;\">​Prof. Sammy Smooha was a guest of the Migdal HaEmek Leadership program \nand presented his ongoing study of Israel’s ethnic rift. Smooha, an \nIsrael Prize laureate in sociology and a lecturer at the University of \nHaifa, presented a historical and social overview of the conditions that\n created the ethnic rift in Israel and explained the reasons why it \npersists even now - despite what he considers the prevailing tendency \nto downplay its intensity or completely deny its existence. Prof. Smooha\n presented four different theoretical perspectives on the development of\n ethnic relations in Israel: the assimilation approach (modernization \nand integration processes), the class-oriented approach, the \npost-colonial approach and the pluralistic approach, in which there is a\n critical discussion while developing or overlooking principles of the \nother perspectives.<\/p>\n<p style=\"text-align:justify;\"><br>Presentation of these approaches allowed for \nfellows to consider the situation and engage in further discussion, \nwhile refining their personal outlooks and experiences. We took this \nopportunity to open the discussion to the community, and several fellows\n invited colleagues and relatives to attend the lecture. It was a \nsuccessful effort that added to the program’s visibility in the city and\n enabled the fellows to expose those around them to their studies.<\/p>\n","images":[],"attachments":[],"outer_links":[]},"cameraseye":{"title":"“Through the Camera’s Eye” at the Kafr Qara Local Leadership Program","date":"2014-03-31","image":"https:\/\/north.mandelfoundation.org.il\/english\/SiteCollectionImages\/News\/camera_Small.jpg","excerpt":"The Mandel Kafr Qara local leadership group participated in a workshop on using photographic language to “learn” a city from an educational and ","link":"https:\/\/north.mandelfoundation.org.il\/english\/About\/News\/Pages\/CamerasEye.aspx","is_inner":"yes","slug":"cameraseye","text":"​The members of the Kafr Qara local leadership group participated during March in a social-political photography workshop. The goal was to train them to use photographic language as a tool for “learning” a city from an educational and social perspective. The premise of the workshop was that photography enables individuals to connect with themselves and discover their artistic side and their own inner beauty. The language of photography offers a means of self-expression, analysis and criticism.\nThe camera, like the eye, selects and records images, conveys the unique perspective of the individual and reflects his or her emotional state. The language of photography is familiar and accessible, enabling it to sidestep defenses, spark non-verbal communication and generate feedback that encourages creativity. Photography allows us to focus, reflect, develop and reframe. Globalization has made the camera available to most people, bringing with it the need to preserve this form of art not only as a tool for documenting family or historical moments but as a means of expressing the self.\nThe field trips during the course involved a combination of movement, walking, and open space through which the participants were able to release energy, discover new viewpoints, and observe their surroundings from a different angle - surroundings that we constantly refer to, but don’t normally transform into a visual creation. At the end of the workshop, we mounted an exhibition of the photographs taken by the participants during the course.\n","html_content":"<p style=\"text-align:justify;\">​The members of the Kafr Qara local leadership group participated during \nMarch in a social-political photography workshop. The goal was to train \nthem to use photographic language as a tool for “learning” a city from \nan educational and social perspective. The premise of the workshop was \nthat photography enables individuals to connect with themselves and \ndiscover their artistic side and their own inner beauty. The language of\n photography offers a means of self-expression, analysis and criticism.<\/p>\n<p style=\"text-align:justify;\"><br>The\n camera, like the eye, selects and records images, conveys the unique \nperspective of the individual and reflects his or her emotional state. \nThe language of photography is familiar and accessible, enabling it to \nsidestep defenses, spark non-verbal communication and generate feedback\n that encourages creativity. Photography allows us to focus, reflect, \ndevelop and reframe. Globalization has made the camera available to \nmost people, bringing with it the need to preserve this form of art not \nonly as a tool for documenting family or historical moments but as a \nmeans of expressing the self.<\/p>\n<p style=\"text-align:justify;\"><br>The field trips during the course \ninvolved a combination of movement, walking, and open space through \nwhich the participants were able to release energy, discover new \nviewpoints, and observe their surroundings from a different \nangle - surroundings that we constantly refer to, but don’t normally \ntransform into a visual creation. At the end of the workshop, we mounted\n an exhibition of the photographs taken by the participants during the \ncourse.<\/p>\n","images":[],"attachments":[],"outer_links":[]},"janeswalk":{"title":"“Jane’s Walk” in Migdal HaEmek","date":"2014-03-30","image":"https:\/\/north.mandelfoundation.org.il\/english\/SiteCollectionImages\/News\/MigdalHeemek_Small.jpg","excerpt":"​Migdal HaEmek leadership program participants have been “learning the city” through walking tours, lectures, meetings with the city’s mayor ","link":"https:\/\/north.mandelfoundation.org.il\/english\/About\/News\/Pages\/JanesWalk.aspx","is_inner":"yes","slug":"janeswalk","text":"​​Migdal HaEmek leadership program participants have been “learning the city” through walking tours, lectures, meetings with the city’s mayor, Eli Barda, and municipal director Shalom Zuzut, and a series called “Observing the View” with Yankale Steinberg (former director of the Mandel Center for Leadership in the Negev).\nThe study unit began with a guided walking tour (known as a “Jane’s Walk” after urban activist Jane Jacobs) led by three group members who presented the Migdal HaEmek of their childhood. In this way, participants got to know the city’s past through their eyes and understand their connection to the place, which led them to become socially involved as adults. Participants then explored their “sense of place” and feelings about the city, and their hopes for its future.\nThe mayor and municipal director visited the program and discussed the city’s projected development. Over the next few years, the population is expected to grow significantly, from 28,000 to 40,000. Migdal HaEmek’s urban planner, Hagit Naaly Yosef, explained the city’s social planning approach, which emphasizes diversity and takes into account the needs of different populations. Led by Yosef, the participants analyzed the city’s plans for new construction. Learning about Migdal HaEmek will continue to be part of the program, and serve as a starting point for the participants to think about the initiatives they wish to promote there.\n","html_content":"<p style=\"text-align:justify;\">​​Migdal HaEmek leadership program participants have been “learning the \ncity” through walking tours, lectures, meetings with the city’s mayor, \nEli Barda, and municipal director Shalom Zuzut, and a series called \n“Observing the View” with Yankale Steinberg (former director of the&nbsp;Mandel \nCenter for Leadership in the Negev).<\/p>\n<p style=\"text-align:justify;\"><br>The study unit began with a \nguided walking tour (known as a “Jane’s Walk” after urban activist Jane \nJacobs) led by three group members who presented the Migdal HaEmek of \ntheir childhood. In this way, participants got to know the city’s past \nthrough their eyes and understand their connection to the place, which \nled them to become socially involved as adults. Participants then \nexplored their “sense of place” and feelings about the city, and their \nhopes for its future.<\/p>\n<p style=\"text-align:justify;\"><br>The mayor and municipal director visited \nthe program and discussed the city’s projected development. Over the \nnext few years, the population is expected to grow significantly, from \n28,000 to 40,000. Migdal HaEmek’s urban planner, Hagit Naaly Yosef, \nexplained the city’s social planning approach, which emphasizes \ndiversity and takes into account the needs of different populations. Led\n by Yosef, the participants analyzed the city’s plans for new \nconstruction. Learning about Migdal HaEmek will continue to be part of \nthe program, and serve as a starting point for the participants to think\n about the initiatives they wish to promote there.<\/p>\n","images":[],"attachments":[],"outer_links":[]},"northsupervisors":{"title":"Continuing Education for Northern District Supervisors","date":"2014-02-12","image":"https:\/\/north.mandelfoundation.org.il\/english\/SiteCollectionImages\/News\/AymanAgbaria_Small.jpg","excerpt":"​The Mandel Center for Leadership in the North hosted 120 Ministry of Education supervisors from the northern district for an in-service training day ","link":"https:\/\/north.mandelfoundation.org.il\/english\/About\/News\/Pages\/NorthSupervisors.aspx","is_inner":"yes","slug":"northsupervisors","text":"​The Mandel Center for Leadership in the North hosted 120 Ministry of Education supervisors from the northern district for an in-service training day on February 12. The diverse group of educators - which included representatives of Jewish, Arab, Druze, and the state-religious school system - ranged from supervisors of kindergartens and special education to professional liaisons and Society & Youth Administration personnel.\nThe day, planned by MCN in cooperation with Anat Cohen, who is responsible for professional development in the region, was the first in a series of three seminars under the center’s auspices on the subject of meaningful learning. The opening remarks were delivered by Dr. Danielle Shani, the center’s director, who presented the Mandel Foundation, the northern program, and its underlying vision. She was followed by Dr. Ayman Agbaria, director of the Mandel Scholars in Education program in Jerusalem for outstanding doctoral students, who spoke about “Policy, Values, and Meaningful Learning,” introducing participants to texts by the medieval Islamic scholars al-Farabi and al-Ghazali. Many participants noted that this exposure to an unfamiliar philosophy was very meaningful for them. Following the lecture, workshops led by Adi Nir Sagi, Dr. Smadar Ben Asher and Dr. Nitza Raskin from the Mandel Center for Leadership in the Negev, and Ayelet Ilany and Dalit Caspin from the center in the North, explored the ultimate objective of learning and the educational process in the school setting. The day concluded with a poetry-writing workshop.\nThe remaining two seminars in the series will take place on March 20 and May 22. The program in March will deal primarily with learning in the urban space. For this purpose, Akko’s Old City will be transformed into a giant classroom, which the supervisors will crisscross in small teams. The day is being planned in conjunction with Even Derech, a company specializing in experiential learning.\n","html_content":"<p style=\"text-align:justify;\">​The Mandel Center for Leadership in the North hosted 120 Ministry of \nEducation supervisors from the northern district for an in-service \ntraining day on February 12. The diverse group of educators&nbsp;- which \nincluded representatives&nbsp;of Jewish, Arab, Druze, and the \nstate-religious school system&nbsp;- ranged from supervisors of kindergartens\n and special education to professional liaisons and Society &amp; Youth \nAdministration personnel.<\/p>\n<p style=\"text-align:justify;\"><br>The day, planned by MCN\n in cooperation with Anat Cohen, who is responsible for professional \ndevelopment in the region, was the first in a series of three seminars \nunder the center’s auspices on the subject of meaningful learning. The \nopening remarks were delivered by Dr. Danielle Shani, the center’s \ndirector, who presented the Mandel Foundation, the northern program, and\n its underlying vision. She was followed by Dr. Ayman Agbaria, director \nof the Mandel Scholars in Education program in Jerusalem for outstanding\n doctoral students, who spoke about “Policy, Values, and Meaningful \nLearning,” introducing participants to texts by the medieval Islamic \nscholars al-Farabi and al-Ghazali. Many participants noted that this \nexposure to an unfamiliar philosophy was very meaningful for them. \nFollowing the lecture, workshops led by Adi Nir Sagi, Dr. Smadar Ben \nAsher and Dr. Nitza Raskin from the Mandel Center for Leadership in the\n Negev, and Ayelet Ilany and Dalit Caspin from the center in the \nNorth, explored the ultimate objective of learning and the educational \nprocess in the school setting. The day concluded with a poetry-writing \nworkshop.<\/p>\n<p style=\"text-align:justify;\"><br>The remaining two seminars in the series will take \nplace on March 20 and May 22. The program in March will deal primarily \nwith learning in the urban space. For this purpose, Akko’s Old City will\n be transformed into a giant classroom, which the supervisors will \ncrisscross in small teams. The day is being planned in conjunction with \nEven Derech, a company specializing in experiential learning.<\/p>\n","images":[],"attachments":[],"outer_links":[]}}}